<?xml version='1.0' encodong='iso8859-1'?>

<!DOCTYPE guide SYSTEM "../dtd/guide.dtd">

<guide type="project" link="/projects/keychain.html">
<title>Keychain</title>
<author title="Author"><mail link="drobbins@gentoo.org">Daniel Robbins</mail></author>
<author title="Traductor"><mail link="ferdy@ferdyx.org">Fernando J. Pereda Garcimartín</mail></author>
<author title="Editor"><mail link="bass@gentoo.org">José Alberto Suárez López</mail></author>

<abstract>
Esta p&aacute;gina contiene informaci&oacute;n sobre Keychain, una aplicaci&oacute;n, para bash, de manejo
de llaves RSA/DSA compatible con OpenSSH.
</abstract>

<version>1.9</version>
<date>04 Mar 2001</date>

<chapter>
<title>Introducci&oacute;n a keychain</title>
<section>
<body>
<p>
Muchos de nosotros usamos <uri link="http://www.openssh.org/es/index.html">OpenSSH</uri> como un
seguro y encriptado reemplazo para los vulnerables comandos telnet y rsh. Una de las caracter&iacute;sticas
m&aacute;s interesantes de OpenSSH, es su capacidad para autentificar usuarios  usando los protocolos
de autentificaci&oacute;n RSA y DSA, que est&aacute;n basados en un par de "llaves" num&eacute;ricas
complementarias. Y una de las cosas que m&aacute;s llaman la atenci&oacute;n de la autentificaci&oacute;n
con RSA y DSA, es la promesa de ser capaz de establecer conexiones a sistemas remotos <e>sin proporcionar
una password</e>. El script de bash <c>keychain</c> gestiona las claves RSA y DSA de una forma conveniente y
segura. Funciona como un front-end a <c>ssh-agent</c>, permiti&eacute;ndole tener un proceso <c>ssh-agent</c>
<e>por cada sistema</e> en lugar de uno por sesi&oacute;n. Esto reduce notablemente el n&uacute;mero de veces
que tiene que proporcionar su frase de paso, desde una vez por cada sesi&oacute;n hasta una <e>cada vez
que su m&aacute;quina se reinicia</e>.
</p>
</body>
</section>
</chapter>
<chapter>
<title>La captura de pantalla</title>
<section>
<body>
<figure link="http://www.ibiblio.org/gentoo/images/keychain-2.gif" caption="Keychain en acci&oacute;n"></figure>

<p>Arriba, <c>drobbins</c> accede a <c>cvs.gentoo.org</c>, y <c>keychain</c>
(ejecutado desde <path>~/.bash_profile</path>) se inicia. <c>keychain</c>
detecta un proceso <c>ssh-agent</c> que contiene las llaves de <c>drobbins</c>
y configura el entorno de shell apropiadamente. Dado que <c>keychain</c>
"se engancha" a un proceso <c>ssh-agent</c> existente, <c>drobbins</c> obtiene
acceso a sus llaves sin tener que proporcionar sus frases de paso, aunque vuelva
a abrir una nueva sesi&oacute;n. El puede establecer conexiones seguras sin
proporcionar el password con cualquier m&aacute;quina remota configurada
para reconocer esas claves. De hecho, <c>drobbins</c> solo tendr&aacute; que
proporcionar su frase de paso otra vez despues de que <c>cvs.gentoo.org</c> 
se reinicie. Esta es la &uacute;nica ocasi&oacute;n en la que realmente
necesitar&iacute;a volver a iniciar el proceso <c>ssh-agent</c>.</p>
</body>
</section>
</chapter>
<chapter>
<title>El c&oacute;digo fuente</title>
<section>
<body>

<p>
La &uacute;ltima revisi&oacute;n de <c>keychain</c> se puede
encontrar aqu&iacute;:<br /><br />
<uri>http://www.ibiblio.org/gentoo/distfiles/keychain-1.9.tar.bz2</uri>
</p>
<pre caption="md5sum">
10b68284f73f76dcdaa43c62b3acde19  keychain-1.9.tar.bz2
a37909a580644d384a21268824931103  keychain-1.8.tar.bz2
</pre>
</body>
</section>
</chapter>
<chapter>
<title>Los art&iacute;culos de IBM developerWorks</title>
<section>
<body>

<p><c>keychain</c> fue introducido por primera vez en la serie
de <uri link="http://www.ibm.com/developerworks">IBM developerWorks</uri>.
<b><uri 
link="http://www-106.ibm.com/developerworks/library/l-keyc.html">El primer art&iacute; de keychain</uri></b>
introduce los conceptos que hay detr&aacute;s de la 
autenticaci&oacute;n RSA/DSA y muestra como configurar una autenticaci&oacute;n
RSA/DSA primitiva (con frase de paso), mientras que <b><uri 
link="http://www-106.ibm.com/developerworks/linux/library/l-keyc2/">el segundo art&iacute;culo</uri></b>
muestra como usar <c>keychain</c> para configurar un acceso seguro con
<c>ssh</c> <e>sin tener que proporcionar passwords</e> de una manera
sencilla y recomendable. <c>keychain</c> tambien proporciona una manera
segura y limpia para que tareas <c>cron</c> tomen ventaja sobre claves RSA/DSA sin
tener que usar claves privadas sin encriptar y por tanto inseguras.
<b><uri link="http://www-106.ibm.com/developerworks/linux/library/1-keyc3/">Un tercer art&iacute;culo</uri></b> muestra
como usar el mecanismo de reenvio de la autenticaci&oacute;n con <c>ssh-agent</c>.
</p>
</body>
</section>
</chapter>
<chapter>
<title>ChangeLog</title>
<section>
<body>
<pre caption="ChangeLog for Keychain">
# ChangeLog for Keychain; http://www.gentoo.org/projects/keychain
# Copyright 2002 Gentoo Technologies, Inc.; Distribuido bajo la GPL v2
# Escrito por Daniel Robbins (drobbins@gentoo.org)

* keychain 1.9 (04 Mar 2002)

  04 Mar 2002; se cambia la licencia, de "GPL, v2 or later" a "GPL v2".
  
  04 Mar 2002; a&ntilde;adido "keychain.cygwin" para sistemas Cygwin. Quiz&aacute;
  sea el momento para seguir este patr&oacute;n  y empezar a construir separados,
  optimizados scripts para cada plataforma asi no se vuelven demasiado pesados. 
  Lo mismo puedo usar un preprocesador C para esto.
  
  06 Dec 2001; a algunas personas: Solaris no le gustan las comparaciones '-e';
  se cambian a '-f'

* keychain 1.8 (29 Nov 2001)

  29 Nov 2001; Philip Hallstrom (philip@adhesivemedia.com)
  A&ntilde;adida opci&oacute;n "--local" para quitar $(HOSTNAME)
  de algunos ficheros que crea keychain. Pr&aacute;ctico para
  usuarios no-NFS.
  
  29 Nov 2001; Aron Griffis (agriffis@gentoo.org)
  Usando el tipo nativo de Bourne, en lugar de usar el comando externo
  "which". Deber&iacute;a hacer las cosas m&aacute;s robustas y algo
  m&aacute;s r&aacute;pidas.  

  09 Nov 2001; Mike Briseno (mike@radic.com)
  En Solaris, el comando "which" env&iacute;a "no lockfile in..." a
  stdout en lugar de stderr. Una l&iacute;nea (comprueba la condici&oacute;n
  de error) ha sido a&ntilde;adida.

  09 Nov 2001; configuraci&oacute;n del lockfile arreglada
 
  09 Nov 2001; Reescrito como keychain detecta intentos fallidos de la
  frase de paso. Si para el proceso proporcionando frases de paso 
  v&aacute;lidas, tres intentos y est&aacute;s fuera.

  09 Nov 2001; Constantine P. Sapuntzakis (csapuntz@standford.edu)
  A algunas claves privadas no se les puede hacer "ssh-keygen -l -f";
  este parche hace que keychain busque la correspondiente clave
  p&uacute;blica si la privada no funciona. ¡Gracias Constantine!

  09 Nov 2001; Victor Leitman (vleitman@yahoo.com)
  Color CIAN no estaba definido; arreglado.
  
  27 Oct 2001; Brian Wellington (bwelling@xbill.org)
  "quiet mode" (--quiet) (modo silencioso) arreglado, se me
  olvid&oacute; un "echo"
  
  27 Oct 2001; J.A. Neitzel (jan@belvento.org)
  Se me olvid&oacute; otro "kill -9"; ya est&aacute;

* keychain 1.7 (21 Oct 2001) 
 
  21 Oct 2001; Frederic Gobry (frederic.gobry@smartdata.ch)
  Frederic sugiri&oacute; usar el lockfile de procmail para
  serializar la ejecuci&oacute;n de partes cr&iacute;ticas
  de keychain, para evitar m&uacute;ltiples procesos de
  ssh-agent corriendo si se abren varios xterm autom&aacute;ticamente.
  Al principio, pens&eacute; en no a&ntilde;adir esto, dado
  que muchos sistemas no tienen el comando lockfile; de todas
  maneras, keychain ahora detectar&aacute; si lockfile est&aacute;
  instalado, si es as&iacute;, keychain lo usar&aacute; para
  prevenir que varios procesos ssh-agent sean iniciados.

  21 Oct 2001; Raymond Wu (ursus@usa.net):
  El test --nocolor deja de estar dentro de los test dado que
  "echo -e" funciona. De acuerdo a lo que dice Raymond, esto
  funciona perfectamente en su Solaris.
  
  21 Oct 2001; J.A. Neitzel (jan@belvento.org):
  A partir de ahora no volveremos a "kill -9" al proceso de
  ssh-agent. SIGTERM deber&iacute;a ser suficiente para
  permitir a ssh-agent que se cierre ordenadamente.
  (este cambio es contrario a un parche anterior)
  
  21 Oct 2001; Thomas Finneid (tfinneid@online.no):
  A&ntilde;adido el argumento "--quiet | -q" para hacer
  al programa menos intrusivo al usuario; cuando se usa,
  solo los errores y mensajes interactivos aparecerán.
  
  21 Oct 2001; Thomas Finneid (tfinneid@online.no):
  Cambiado el formato de algunos argumentos para que
  sean m&aacute;s parecidos a los programas *nix:
  a&ntilde;adido "-h" como alias para "--help" y
  "-k" como alias para "--stop"

  21 Oct 2001; Mark Stosberg (mark@summersault.com):
  $pidf a "$pidf", esto permite a keychain funcionar oon
  rutas que incluyan espacios (para Darwin y MacOS X en particular).
  
  21 Oct 2001; Jonathan Wakely (redi@redi.uklinux.net):
  Peque&ntilde;o parche para convertir "echo -n -e" a
  "echo -e "\c"" para compatibilidad con FreeBSD.

* keychain 1.6 (15 Oct 2001)

  13 Oct 2001; Ralf Horstmann (ralf.horstmann@webwasher.com):
  A&ntilde;adido /usr/ucb al path para sistemas Solaris.
  
  11 Oct 2001; Idea from Joe Reid (jreid@vnet.net):
  Intente a&ntilde;adir varias claves usando ssh-add;
  evite escribir frases de paso id&eacute;nticas alguna vez.
  ¡Buena idea!

*keychain 1.5 (21 Sep 2001)

  21 Sep 2001; David Hull (hull@paracel.com):
  Miscelanea, comtatibilidad, manejo de se&nacute;ales,
  limpiar algunos arreglos.
  
  21 Sep 2001; 
  Test al comando "ps" para encontrar el correcto
  para tu SO.

  20 Sep 2001; Marko Myllynen (myllynen@lut.fi):
  "grep [s]sh-agent" to "grep [s]sh-agent" (zsh fix)

*keychain 1.4 (20 Sep 2001)

  20 Sep 2001; David Hull (hull@paracel.com):
  "touch $foo" a ">$foo" y otros arreglos no-fork (no desencadenar procesos
  hijos). Se convierte ${foo#--} a una sentencia case para compatibilidad
  sh en Solaris.

  20 Sep 2001;
  Pruebe una sintexis diferente para "ps" si la suya falla. Esto
  deber&iacute;a dar compatibilidad con Solaris y con IRIS (sysV)
  sin romper la existente con BSD.

  20 Sep 2001; Hans Peter Verne (h.p.verne@usit.uio.no);
  "echo -e" a "echo ~E" (para compatibilidad con IRIS y --nocolor),
  optimizaci&oacute;n de grep ("grep [s]sh-agent")
  
  17 Sep 2001; Marko Myllynen (myllynen@lut.fi):
  Algunos arreglos: bloqueo de la señal 2 si la señal INT no est&aacute;
  soportada (NetBSD); manejar claves no v&aacute;lidas correctamente;
  antiguas versiones de ash no soportan ~, as&iacute; que se pasa a usar
  $HOME; se corrigen las instrucciones zsh; peque&ntilde;a limpieza.

*keychain 1.3 (12 Sep 2001)
  
  12 Sep 2001;
  Peque&ntilde;os cambios en el color; e cyan era muy dificil de leer
  en xterm-colored, as&iacute; se cambia a bold (negrita). Se a&ntilde;ade
  algo de texto a --help.
  
  10 Sep 2001;
  Ahora usamos .ssh-agent-[hostname] en lugar de .ssh-agent.
  Ahora creamos un .ssh-agent-csh-[hostname] para que se pueda
  usar con csh.compatible shells. Tambi&eacute;n se mata (kill)
  todos nuestros procesos de ssh-agent existentes antes de
  empezar uno nuevo.

  10 Sep 2001; Robert R. Wal (rrw@hell.pl):
  Arreglos muy bonitos para NFS, arreglos con los colores, y 
  el tcsh refirect -> grep -v tambi&eacute;n est&aacute; arreglado-
  Gracias a todos los que me mandaron parches similares.

  10 Sep 2001; Johann Visagie (johann@egenetics.com):
  Arreglos de compatibilidad con el shell (cambio de "source" a ".")
  Gracias por el port en FreeBSD.
  10 Sep 2001; Marko Myllynen (myllynen@lut.fi):
  rm -f $pidf despue&eacute;s de parar ssh-agent

*keychain 1.2 

  09 Sep 2001; El README se actualiza para reflejar cambios
  
  09 Sep 2001; Marko Myllynen (myllynen@lut.fi):
  compatiblidad con bash l/zsh/sh; ahora solo se intenta
  matar (kill) *sus* procesos ssh-agent, arreglo en la versi&oacute;n,
  detetci&oacute;n de un posible error al crear el .ssh-agent. ¡Gracias!

*keychain 1.1; arreglado la llamada a "pidof"; README; ChangeLog

  07 Sep 2001;
  Se a&ntilde;ade al README que keychain necesita bash 2.0 o mayor, as&iacute;
  como algunas directrices r&aacute;pidas de instalaci&oacute;n y la URL de la web.

  07 Sep 2001;
  A&ntilde;adidos /sbin y /usr/sbin al path, y despu&eacute;s se llama a
  "pidof". Creo que esto es m&aacute;s robusto.
  
  06 Sep 2001; from John Ellson (ellson@lucent.com): 
  "pidof" cambiado a "/sbin/pidof", dado que es probable que no est&eacute;
  en $PATH.
 
  06 Sep 2001;
  Nuevo ChangeLog! :)

*keychain 1.0; revisi&oacute;n inicial (Aug 2001)
</pre>
</body>
</section>
</chapter>
</guide>

