<?xml version='1.0'?>
<!DOCTYPE guide SYSTEM "../../../dtd/guide.dtd">

<guide link="/doc/desktop.html">
<title>Anleitung zur Gentoo Linux Desktop Konfiguration</title>
<author title="Editor"><mail link="g2boojum@gentoo.org">Grant Goodyear</mail></author>
<author title="&#220;bersetzter"><mail link="gentoo@naggelgames.de">Hendrik Richter</mail></author>

<abstract>
Mit Hilfe dieser Anleitung k&#246;nnen Sie Ihr Gentoo Linux zu einem vollwertigen 
Desktop-System einrichten. Sie erfahren, wie man X, KDE, OSS und alsa (Sound), 
postfix (E-Mail), cups (Drucken), und samba (Unix/Windows Dateiaustausch) 
installiert und konfiguriert.
</abstract>

<version>0.26</version>
<date>17 May 2002 (&#220;bersetzung: 19 Okt 2002)</date>

<chapter>
<title>Voraussetzungen</title>
<section>
<body>
<p>Eigentlich nicht n&#246;tig zu erw&#228;hnen: bevor Sie mit dieser Anleitung anfangen, 
m&#252;ssen Sie Gentoo Linux <uri link="build.html">installiert</uri> haben. Nach 
Abschluss dieser recht am&#252;santen Prozedur brauchen Sie noch zus&#228;tzlich den 
aktuellen <e>Portage</e> tree. Es ist wirklich empfehlenswert, den <uri 
link="portage-user.html">Portage User Guide</uri> zu lesen, aber falls Sie 
ungeduldig sind oder unter Zeitdruck stehen, schreiben Sie einfach:</p>

<pre># <i>emerge rsync</i></pre>

<p>
Noch ein kurzer Hinweis zu den Paketen die ich hierf&#252;r ausgew&#228;hlt habe. Gentoo 
Linux hat eine riesige Menge an Window Managern, E-Mail-Programme, etc, die 
einfach installiert werden k&#246;nnen. Die Pakete, die ich ausgew&#228;hlt habe sind 
nicht besonders f&#252;r Gentoo Linux gemacht, es sind einfach die Pakete, die der 
Autor kennt und zu konfigurieren wei&#223;. Mit anderen Worten, dies sind die Pakete 
des Desktops des Autors.
</p>

</body>
</section>
</chapter>

<chapter>
<title>X und KDE</title>

<section>
<title>Installation</title>
<body>
<p>
Nach der Installation von Gentoo Linux und dem updaten des Portage, ist mein 
erster weiterer Schritt die Installation von X und KDE. X braucht ewig lange zum 
kompilieren, und KDE sogar noch l&#228;nger; daher empfehle ich wirklich, mit dem 
Vorgang kurz vorm Zubettgehen zu beginnen.
</p>
<p>
Es ist immer n&#252;tzlich, die <c>--pretend</c> flag vor einem <c>emerge</c> zu 
benutzen, um eine Auflistung aller installierenden Abh&#228;ngigkeiten zu erhalten, 
was in unserem Fall eine recht lange Liste ist.</p>
<pre>
# <i>emerge --pretend kde-base/kde</i>

These are the packages that I would merge, in order.

Calculating dependencies............... done!
[ebuild N  ] x11-base/xfree-4.2.0-r5 to /
[ebuild N  ] media-libs/lcms-1.06 to /
[ebuild N  ] media-libs/jpeg-6b-r2 to /
[ebuild N  ] media-libs/libmng-1.0.1 to /
[ebuild N  ] media-libs/libpng-1.0.12 to /
[ebuild N  ] x11-libs/qt-2.3.1 to /
[ebuild N  ] dev-libs/libxml2-2.4.13 to /
[ebuild N  ] dev-libs/libxslt-1.0.10 to /
[ebuild N  ] dev-lang/tcl-8.3.3 to /
[ebuild N  ] dev-lang/tk-8.3.3 to /
[ebuild N  ] dev-lang/python-2.2-r4 to /
[ebuild N  ] media-libs/tiff-3.5.7 to /
[ebuild N  ] net-print/cups-1.1.13 to /
[ebuild N  ] app-text/sgml-common-0.6.1 to /
[ebuild N  ] net-nds/portmap-5b-r6 to /
[ebuild N  ] app-admin/fam-oss-2.6.4-r1 to /
[ebuild N  ] media-libs/audiofile-0.2.3 to /
[ebuild N  ] media-sound/alsa-driver-0.5.12a to /
[ebuild N  ] media-libs/alsa-lib-0.5.10b to /
[ebuild N  ] kde-base/kdelibs-2.2.2-r2 to /
[ebuild N  ] kde-base/kdegames-2.2.2 to /
[ebuild N  ] kde-base/kdenetwork-2.2.2 to /
[ebuild N  ] dev-libs/popt-1.5 to /
[ebuild N  ] app-arch/rpm-3.0.6-r1 to /
[ebuild N  ] kde-base/kdeadmin-2.2.2 to /
[ebuild N  ] kde-base/kdeartwork-2.2.2 to /
[ebuild N  ] dev-libs/pilot-link-0.9.6-r3 to /
[ebuild N  ] kde-base/kdepim-2.2.2 to /
[ebuild N  ] kde-base/kdetoys-2.2.2 to /
[ebuild N  ] kde-base/kdeutils-2.2.2 to /
[ebuild N  ] dev-lang/nasm-0.98-r3 to /
[ebuild N  ] media-sound/esound-0.2.23 to /
[ebuild N  ] media-libs/libsdl-1.2.3-r1 to /
[ebuild N  ] x11-libs/gtk+-1.2.10-r4 to /
[ebuild N  ] media-video/xanim-2.80.1-r1 to /
[ebuild N  ] x11-libs/openmotif-2.1.30-r1 to /
[ebuild N  ] media-libs/libogg-1.0_rc3 to /
[ebuild N  ] media-libs/libvorbis-1.0_rc3 to /
[ebuild N  ] media-sound/cdparanoia-3.9.8 to /
[ebuild N  ] kde-base/kdemultimedia-2.2.2 to /
[ebuild N  ] kde-base/kdebase-2.2.2-r2 to /
[ebuild N  ] kde-base/kdeaddons-2.2.2-r1 to /
[ebuild N  ] media-gfx/sane-backends-1.0.5-r1 to /
[ebuild N  ] dev-util/dialog-0.7 to /
[ebuild N  ] net-libs/libwww-5.3.2-r1 to /
[ebuild N  ] app-text/tetex-1.0.7-r7 to /
[ebuild N  ] kde-base/kdegraphics-2.2.2 to /
[ebuild N  ] kde-base/kde-2.2.2-r1 to /

<comment>Ihre Abh&#228;ngigkeiten sehen m&#246;glicherweise etwas anders aus.</comment>

# <i>emerge kde-base/kde</i>
</pre>
<note>
Seit portage-1.8.7 kann der Befehl <c>emerge</c> ohne Angabe der Kategorie 
benutzt werden. Dadurch kann KDE mit einem einfachen <c>emerge kde</c> 
installiert werden.
</note>
<note>
Falls Sie vorhaben, CUPS zum Drucken zu benutzen, dann sollten sie "cups" in 
Ihre USE-Variablen in <path>/etc/make.conf</path> eintragen, bevor Sie 
kde-base/kdebase emergen.
</note>
<note>
Sind Sie im Besitz eine Gentoo Linux Binary CD, so k&#246;nnen Sie die Pakete direkt 
von der CD installieren.
</note>
<pre caption="Die Bin&#228;rpakete direkt von CD installieren">
# <c>export PKGDIR=/mnt/cdrom/gentoo/packages</c>
<comment>Normalerweise erwartet Portage die Pakete in 
/usr/portage/packages</comment>
# <c>emerge --usepkg /mnt/cdrom/gentoo/packages/All/kdebase-x.y.z.tbz2</c>
<comment>Die <c>--usepkg</c> flag stellt sicher, dass Bin&#228;rpakete (falls 
vorhanden) f&#252;r die Abh&#228;ngigkeiten benutzt werden.</comment>
</pre>
</body>
</section>

<section>
<title>Konfiguration</title>
<body>
<p>
Um X zu konfigurieren, benutze ich das Konsolen-Tool <c>xf86config</c>, obwohl 
die erstellte <path>/etc/X11/XF86Config</path> nicht sehr elegant ist - siehe
<uri
link="http://www-105.ibm.com/developerworks/education.nsf/linux-onlinecourse-bytitle/3100FF4795B3F31F86256AF70056FDB3?OpenDocument">
dieses Tutorial (englisch)</uri> f&#252;r eine alternative und sorgf&#228;ltigere 
Konfiguration.
Bevor Sie anfangen, ben&#246;tigen Sie die Horizontale und die Vertikale Frequenz 
(Refresh Rate) Ihres Monitors (mein Viewsonic G773 hat Horizontal: 30-69 KHz, 
Vertikal: 55-90 KHz), den Type und den RAM (in KB) Ihrer Grafikkarte (meine 
GeForce hat 32768 KB) sowie den Typ und Anschluss Ihrer Maus (bei mir eine 
Intellimaus im PS/2 Port <path>/dev/psaux</path>).
</p>
<pre># <c>/usr/X11R6/bin/xf86config</c></pre>
<p>Da ich eine Maus mit 3 Kn&#246;pfen habe, entscheide ich mich gegen die 
3-Button-Emulation. Auf die zus&#228;tzlichen XKB-Keyboard-Options verzichte ich 
ebenfalls, da ich nicht wei&#223;, was sie bewirken.
Sp&#228;ter m&#252;ssen Sie sich f&#252;r eine Bildschirmaufl&#246;sung und eine Farbtiefe 
entscheiden, die Ihnen liegt. Ich benutze 1280x1024 bei 24bpp auf meinem 
Viewsonic, da er eine h&#246;here Aufl&#246;sung leider nicht unterst&#252;tzt. Falls Sie noch 
nie etwas vergleichbares getan haben, wundern Sie sich nicht, wenn Sie 
<c>xf86config</c> noch mehrere Male aufrufen m&#252;ssen, bis Sie ein 
zufrieden stellendes Ergebnis haben.</p>

<note>Wenn Sie nicht wissen, welche Refresh Rate Ihr Monitor hat, versuchen Sie 
es mit einer <uri link="http://www.google.de">Google-Suche</uri> nach der 
Modelnummer und dem Hersteller Ihres Monitors. Die Refresh Raten sind 
normalerweise Teile der &#252;brigen Monitor-Spezifikationen.</note>

<p>Wenn Sie ein Veteran im Konfigurieren von X sind, sollte Ihnen die 
Einrichtung eines symbolischen Linkes Ihrer Maus auf 
<path>/dev/mouse</path> gel&#228;ufig sein. Solche 'symlinks' sind bekannt f&#252;r 
Probleme mit devfs (dem <b>Dev</b>ice <b>F</b>ile<b>S</b>ystem), da sie dazu 
neigten, nach einem Neustart zu verschwinden. Gentoo Linux behandelt symbolische 
Links in <path>/dev</path> nun korrekt. Erstellen Sie den 
<path>/dev/mouse</path> symlink mit <c>ln -s</c> und er <e>wird</e> auch nach 
einem Neustart noch vorhanden sein.</p>

<pre># <i>startx</i></pre>
<p>Wenn Sie X richtig konfiguriert haben, sollte <c>startx</c> einen 
&#252;berraschend h&#228;sslichen X Window Manager starten (twm, um genau zu sein). Wenn X 
hochf&#228;hrt, sind Sie gut dran. Dr&#252;cken Sie
<c>&lt;Strg&gt;&lt;Alt&gt;&lt;Backspace&gt;</c> um den X Server zu beenden.</p>

<p>Sollte Ihre Maus ein Mausrad haben, dann sollten Sie die XF86Config-Datei von 
hand editieren:</p>
<pre>
# <i>cp /etc/X11/XF86Config /etc/X11/XF86Config.working</i>
# <i>nano -w /etc/X11/XF86Config</i></pre>
<pre caption="Der Abschnitt Pointer in XF86Config">
Section "InputDevice"

# Identifier and driver

    Identifier	"Mouse1"
    Driver	"mouse"
    <i>Option "Protocol"    "IMPS/2" </i>
    Option "Device"      "/dev/psaux"
    <i>Option "ZAxisMapping"	"4 5"</i>

</pre>
<p>Da ich eine Intellimaus habe, &#228;nderte ich das "Protocol" von "PS/2" in 
"IMPS/2". Um das Rad zum scrollen zu benutzen, m&#252;ssen Sie die Zeile 'Option 
"ZAxisMapping" "4 5"' hinzuf&#252;gen. Hierbei steht '4' f&#252;r Mausrad auf und '5' f&#252;r 
Mausrad ab.</p>
<note>Netscape 4.x benutzt das Mausrad normalerweise nicht, Sie m&#252;ssen daf&#252;r 
eine .Xdefaults Datei erstellen; wie das geht, steht <uri 
link="http://www-sop.inria.fr/koala/colas/mouse-wheel-scroll/">hier 
(englisch)</uri>. Noch besser ist die Benutzung eines richtigen Browsers wie 
<c>konqueror</c>, <c>opera</c>, <c>mozilla</c> oder <c>galeon</c>.</note>
<p>F&#252;hren Sie <c>startx</c> noch einmal aus, um sicherzustellen, das X immernoch 
starten. Falls Sie eine nVidia-Grafikkarte haben, sollten Sie nun die nVidia 
beschleunigten Treiber installieren.</p>
<pre caption="Nur f&#252;r Besitezr von nVidia-Karten">
# <c>emerge media-video/nvidia-kernel media-video/nvidia-glx</c>
# <c>nano -w /etc/X11/XF86Config</c>
# <c>echo NVdriver >> /etc/modules.autoload</c>
</pre>
<pre caption="GLX in /etc/X11/XF86Config einschalten">
Section "Module"

# This loads the GLX module
#    Load       "glx" <comment>(Das # in dieser Zeile entfernen)</comment>
</pre>
<pre caption="Mithilfe der /etc/X11/XF86Config X anweisen, die nVidia-Treiber 
zu benutzen">
Section "Device"
    Identifier  "NVIDIA GeForce"
    #Driver      "nv"
    Driver      "nvidia"
    #VideoRam    32768
    # Insert Clocks lines here if appropriate
EndSection
</pre>
<p>Starten Sie nun nocheinmal <c>startx</c> um sicherzustellen, das X immernoch 
startet (falls Sie die nVidia-Treiber installiert haben, sehen Sie vorher den 
nVidia Splash Screen).
Davon ausgehen, dass es weiterhin funktioniert, beenden Sie X und wir starten 
einen richtigen Window Manager an seiner Stelle. Hierbei geht mein Dank Achim,
Danarmak and Verwilst, Gentoos Entwickler f&#252;r die KDE-Pakete, die sich 
automatisch und recht gut konfigurieren. Der KDM Display Manager sollte nach 
seinem Starten erscheinen.</p>
<pre># <i>kdm</i></pre>
<p>Sie sollten sich nun einloggen und KDE in voller Pracht bestaunen k&#246;nnen. 
Nat&#252;rlich arbeitet der Sound noch nicht, aber dies werden wir in wenigen 
Augenblicken beheben. &#246;ffnen Sie eine Konsole und tippen Sie <c>ls /usr/bin</c> 
(oder etwas anderes, dass mehr Platz beansprucht als das Fenster der Konsole 
bietet), und probieren Sie, ob Sie mit dem Mausrad hoch und runter scrollen 
k&#246;nnen. Es sollte problemlos funktionieren!</p>

<p>Das einzige was noch zu tun ist, ist f&#252;r einen automatischen Start von X beim 
Booten zu sorgen. &#196;ndern Sie die <path>/etc/rc.conf</path> so um,
dass <e>DISPLAYMANAGER="kdm"</e>.
</p>
<pre>
# <i>nano -w /etc/rc.conf</i>
</pre>
<pre caption="/etc/rc.conf -- Abschnitt DISPLAYMANAGER">
# What display manager do you use ?  [ xdm | gdm | kdm ]

DISPLAYMANAGER=kdm
</pre>
<p>
Nun m&#252;ssen wir nur noch sicherstellen, dass <e>xdm</e> automatisch startet beim 
Booten.
</p>
<pre>
# <i>rc-update add xdm default</i>
</pre>
<p>Starten Sie den PC neu, und sehen Sie, ob X automatisch starten.</p>
<impo>Der Befehl <c>rc-update</c> ist Gentoo Linux' verbesserte Version des 
ehrw&#252;rdigen <c>chkconfig</c> Befehls zur Verwaltung der init-Scripte. Durch 
alleinigen Aufruf von <c>rc-update</c> erhalten Sie eine Liste seiner Optionen.
</impo>

</body>
</section>
</chapter>

<chapter>
<title>Sound</title>
<section>
<title>Alsa</title>
<body>

<p>Gentoo Linux unterst&#252;tz Alsa f&#252;r den Sound mit Hilfe des Standartkernels. Alsa kann sowohl mit als auch ohne <e>devfs</e> benutzt werden. Jedoch ein Hinweis: Wenn Sie ein neues <path>sys-kernel/linux-sources</path>-Paket installiert haben, sollten Sie sicherstellen, dass in Ihrem Kernel "sound support" aktiviert ist.</p>

<pre>
# <i>emerge media-sound/alsa-driver</i>
</pre>
<p>
Ich gehe nun davon aus, dass <e>devfs</e> aktiviert ist; falls nicht, lesen Sie bitte die <uri link="http://www.gentoo.org/doc/faq.html">Gentoo FAQ</uri>.
</p>
<p>Nun stellen wie die <e>kerneld</e>-Aliase ein.</p>
<pre>
# <i>nano -w /etc/modules.d/alsa</i>
# <i>update-modules</i>
</pre>
<pre caption="Am Anfang von /etc/modules.d/alsa">
##
## IMPORTANT:
## You need to customise this section for your specific sound card(s)
## and then run `update-modules' command.
## Read alsa-driver's INSTALL file in /usr/share/doc for more info.
##
##  ALSA portion
<i>alias snd-card-0 snd-emu10k1</i>
<i>alias snd-card-1 snd-emu10k1</i>
<i>alias snd-card-2 snd-emu10k1</i>
<i>alias snd-card-3 snd-emu10k1</i>
<i>alias snd-card-4 snd-emu10k1</i>
<i>alias snd-card-5 snd-emu10k1</i>
<i>alias snd-card-6 snd-emu10k1</i>
<i>alias snd-card-7 snd-emu10k1</i>
</pre>
<p>
<e>snd-card-emu10k1</e> ersetzen Sie bitte mit Ihrer Soundkarte.
</p>
<p>Sie sollten ausserdem &#252;berpr&#252;fen, ob in <path>/etc/devfsd.conf</path> die Alsa-Ger&#228;te sowie -Rechte korrekt registriert sind.</p>
<pre>
# <i>nano -w /etc/devfsd.conf</i>
# <i>rc-update add alsasound boot</i>
</pre>
<pre caption="In der Mitte von devfsd.conf mit 'Alsa/OSS stuff'">
# ALSA/OSS stuff
# Comment/change these if you want to change the permissions on
# the audio devices
LOOKUP          snd          MODLOAD ACTION snd
LOOKUP          dsp          MODLOAD
LOOKUP          mixer        MODLOAD
LOOKUP          midi         MODLOAD
REGISTER        sound/.*     PERMISSIONS root.audio 660
REGISTER        snd/.*       PERMISSIONS root.audio 660
</pre>
<note>Beachten Sie bitte, dass devfsd.conf die Rechte f&#252;r <path>/dev/sound</path> auf <c>root.audio</c> setzt. Daher m&#252;ssen nicht-root-Benutzer in der Gruppe <c>audio</c> sein, um Sound zu haben.
</note>
<warn>Das alsasound-Script sollte dem "boot"-Runlevel hinzugef&#252;gt werden, nicht dem "default"-runlevel.</warn>
<p>
An diesem Punkt ist es am einfachsten, einen Neustart auszuf&#252;ren. Jedoch werden Sie auch danach noch keinen Ton h&#246;ren, Alsa schaltet von Haus aus alle Kan&#228;le stumm.
</p>
<pre>
# <i>emerge media-sound/alsa-utils</i>
# <i>amixer</i>

Group 'Input Gain',0
  Capabilities: volume mute jointly-mute
  Channels: Front-Left Front-Right
  Limits: min = 0, max = 15
  Front-Left: 11 [73%] [mute] [---]
  Front-Right: 11 [73%] [mute] [---]
Group 'Master Mono',0
  Capabilities: volume mute capture exclusive-capture
  Capture exclusive group: 1
  Channels: Front-Left Front-Right
  Limits: min = 0, max = 31
  Front-Left: 23 [74%] [mute] [---]
  Front-Right: 23 [74%] [mute] [---]
Group 'Headphone',0
  Capabilities: volume mute jointly-mute
  Channels: Front-Left Front-Right
  Limits: min = 0, max = 31
  Front-Left: 0 [0%] [mute] [---]
  Front-Right: 0 [0%] [mute] [---]
Group 'Master',0
  Capabilities: volume mute jointly-mute capture exclusive-capture
  Capture exclusive group: 1
  Channels: Front-Left Front-Right
  Limits: min = 0, max = 63
  Front-Left: 50 [79%] [mute] [---]
  Front-Right: 50 [79%] [mute] [---]
<comment>[chopped for brevity]</comment>

# <i>amixer set Master 100 unmute</i>
# <i>amixer set PCM 100 unmute</i>
# <i>aplay /usr/kde/3/share/sounds/pop.wav</i> <comment>(pop.wav is part of 
KDE)</comment>
</pre>
<p>
Nach der Installation der "alsa utilities" benutzen wir <c>amixer</c> um die Master- und PCM-Soundkan&#228;le auf eine Lautst&#228;rke von 100% zu stellen. Ausserdem &#252;berpr&#252;fen wir mit Hilfe von <c>aplay</c> (alsa play), ob die Soundausgabe funktioniert. Wenn Sie einen "pop" h&#246;ren, funktioniert Ihre Soundunterst&#252;tzung. Danach sollten Sie die Lautst&#228;rke Ihrem Geschmack anpassen, was mit Hilfe des ncurses-basiertem <c>alsamixer</c> sehr gut funktioniert.
</p>
<p>
Sobald Sie Ihr System neu starten, speichert das <e>alsasound</e> Init-Script Ihre Einstellungen und stellt sie sp&#228;ter wieder her.
</p>
</body>
</section>
<section>
<title>Standard Kernel Sound-Module</title>
<body>
<p>Um Standard Kernel Sound zu benutzen, m&#252;ssen Sie Ihren Kernel neu kompillieren, soforn Sie Ihr Sound-Modul nicht bei der Gentoo-Installation einkompilliert haben.
Falls Sie den Soundtreiber als ein Modul kompillieren (anstatt direkt in den Kernel), dann m&#252;ssen Sie den Modulnamen (ohne die .o Extension) in <path>/etc/modules.autoload</path> eintragen. Wenn Sie das Sound-Modul in den Kernel kompilliert haben, starten Sie Ihren Rechner neu; wenn Sie das Modul als Modul benutzen, reicht auch ein <c>modprobe drivername</c> aus.
Mit etwas Gl&#252;ck ist nun der richtige Sound-Treiber geladen, um Sound zu haben, sind jedoch noch einige weitere Schritte erforderlich.
</p>
<pre caption="non-devfs users only">
# <i>cd /dev</i>
# <i>/usr/sbin/MAKEDEV audio</i>
</pre>
<pre>
# <i>cat /usr/kde/2/share/sounds/pop.wav &gt; /dev/dsp</i>
# <i>emerge media-sound/sox</i>
# <i>play /usr/kde/2/share/sounds/pop.wav</i>
</pre>
<p>
Wenn Sie nach dem "cat'ten" der .wav-Datei zu <path>/dev/dsp</path> etwas h&#246;ren, dann sollte Ihre Sound funktionieren. Durch das emergen von sox kann der Befehl <c>play</c> zum Abspielen von .wav-Dateien benutzt werden, wodurch sich die .wav-Dateien (anders als beim Benutzen des cat-Befehls) sogar gut anh&#246;ren. 
</p>
<!-- 
found that when running <e>devfs</e> the /dev/MAKEDEV script
would be missing.  Help? Well, you shouldn't need to run MAKEDEV if you're
using devfs (maybe to get /dev/dsp created?), but if you need it, its real home 
is in /usr/sbin (/dev/MAKEDEV is
a symlink.  I changed the text to reflect this. [drobbins]
-->
</body>
</section>
<section>
<title>Sound und KDE</title>
<body>
<p>
KDE hat einige nette Sound-Hilfsmittel, unter Anderem den KDE-Sound-Mixer <c>kmix</c>.
</p>
<pre>
# <i>emerge --search kdemultimedia</i>
[ Results for search key : kdemultimedia ]
[ Applications found : 1 ]

*   kde-base/kdemultimedia
      Latest version Available:  2.2.2
      Latest version Installed:  2.2.2
      Description:  ${DESCRIPTION}Multimedia
# <i>kmix</i>
</pre>
<note>Sollte kmix keinen Mixer finden, dann denkt es eventuell, dass Sie keine Soundunterst&#252;tzung haben. Loggen Sie sich aus und entfernen Sie <path>~/.kde/share/config/kmixrc</path> und <path>~/.kde/share/config/kmix:*</path>, danach loggen Sie sich wieder ein. Danach sollte der Sound-Mixer richtig funktionieren.</note>
</body>
</section>
</chapter>

<chapter>
<title>Mail</title>
<section>
<title>Postfix -- Installation und Konfiguration</title>
<body>
<p>
Mir pers&#246;nlich gef&#228;llt das <c>postfix</c> Mail-System am besten, da es <c>sendmail</c> (ohne den Albtraum seiner Konfiguration) emuliert. Wo wir schon dabei sind, installieren wir auch gleich den Mail-Client <c>mutt</c>, sodass wir unsere <c>postfix</c>-Konfiguration &#252;berpr&#252;fen k&#246;nnen.</p>
<pre>
# <i>emerge --pretend net-mail/postfix net-mail/mutt</i>

These are the packages that I would merge, in order.
 
Calculating dependencies... done!
[ebuild N  ] dev-libs/libpcre-3.4-r1 to /
[ebuild N  ] net-mail/mailbase-0.00-r1 to /
[ebuild N  ] net-mail/postfix-20010228.2 to /
[ebuild N  ] net-mail/mutt-1.3.22.1 to /

# <i>emerge net-mail/postfix net-mail/mutt</i>
</pre>
<p>
Falls Sie Ihren Mail-Server ausschlie&#223;lich zum Versenden von Mails benutzen m&#246;chten, dann ist postfix bereit richtig konfiguriert f&#252;r Sie. Andernfalls sollten Sie die Datei <path>/etc/postfix/main.cf</path> editieren. Die <path>main.cf</path> ist gut kommentiert und biete gute Standartwerte f&#252;r einen Standalone-Rechner. Wenn Ihr Rechner direkt mit dem Internet verbunden ist (z.B. mit einer nicht-privaten IP-Adresse und DNS-Namen), dann gibt es nur eine &#196;nderung, die Sie durchf&#252;hren sollten: das Aktivieren des Mailempfangs mit postfix.

</p>
<pre caption="Mailempfang in main.cf einschalten">
# RECEIVING MAIL

# The inet_interfaces parameter specifies the network interface
# addresses that this mail system receives mail on.  By default,
# the software claims all active interfaces on the machine. The
# parameter also controls delivery of mail to user@[ip.address].
#
#inet_interfaces = all
#inet_interfaces = $myhostname
#inet_interfaces = $myhostname, localhost
<i>inet_interfaces = $myhostname, localhost</i>
<i>mydestination = $myhostname, localhost.$mydomain</i>
</pre>


</body>
</section>
<section>
<title>Postfix-Test (mitt Mutt)</title>
<body>
<p>
Schau'n wir mal, ob's funktioniert.
</p>
<pre>
# <i>postfix check</i>
<!--
postfix-script: warning: creating missing Postfix pid directory
postfix-script: warning: creating missing Postfix incoming directory
postfix-script: warning: creating missing Postfix active directory
postfix-script: warning: creating missing Postfix bounce directory
postfix-script: warning: creating missing Postfix defer directory
postfix-script: warning: creating missing Postfix deferred directory
postfix-script: warning: creating missing Postfix flush directory
postfix-script: warning: creating missing Postfix saved directory
postfix-script: warning: creating missing Postfix corrupt directory
postfix-script: warning: creating missing Postfix public directory
postfix-script: warning: creating missing Postfix private directory
-->
# <i>newaliases</i>
# <i>postfix start</i>
postfix-script: starting the Postfix mail system
# <i>mutt -x root</i>
/root/.maildir does not exist. Create it? ([y]/n): <comment>[y eingeben]</comment>
To:  &lt;root&gt;
Subject: test
(End message with a . on a line by itself)
test
.

# <i>mutt</i>
<comment>[Hier sollten Sie Ihre Nachricht sehen]</comment>
</pre>
<p>
Mit <c>postfix check</c> stellen wir sicher, dass in <path>main.cf</path> keine Fehler sind und einige wichtige Verzeichnisse erstellt werden. <c>newaliases</c> stellt die Mail-Aliase des Systems ein, und <c>postfix start</c> startet den Mailer.
Danach benutze ich <c>mutt</c> (im <c>mailx</c>- oder altmodischem <c>mail</c>-Modus) um eine Nachricht an mich selber (auf dem lokalen Rechner) zu schicken. Dabei erstellt <c>mutt</c> das Mail-Verzeichnis <path>~/.maildir</path> des Benutzers (in diesem Fall root). <c>mutt</c> im v&#246;llig interaktiven Modus zeigte mir dann meine Nachricht, es funktioniert also schonmal wenigstens der lokale Mailversand und -empfang. Danach verschickt ich eine Mail an eine meiner nicht-lokalen Adressen (nicht gezeigt) und &#252;berpr&#252;fte, ob sie dort ankam, was sie tat.</p>
<warn>Wenn Sie eine Mails mit den Standarteinstellungen der <path>main.cf</path> verschicken, dann wird diese vielleicht niemals ankommen. Viele Mailserver lehnen automatisch Mails ab, deren Ursprungsserver nicht mit reverse-DNS festgestellt werden kann.
</warn>
<p>
Davon ausgehend, dass nun alles funktioniert, sorgen wir nun daf&#252;r, dass postfix beim Booten automatisch startet.
</p>
<pre>
# <i>postfix stop</i>
postfix-script: starting the Postfix mail system
# <i>rc-update add postfix default</i>
 * postfix added to runlevel default...
 * Caching service dependencies...          [ ok ] 
 * rc-update complete.
# <i>/etc/init.d/postfix start</i>
Starting postfix......     [  ok  ]
</pre>
<impo><c>sendmail</c>- und <c>postfix</c>-Veteranen sollten es gewohnt sein, dass Mails in <path>/var/spool/mail</path> anstatt im Home-Verzeichnis sowie im <e>mbox</e>- anstatt dem <e>maildir</e>-Format gespeichert werden. Trotzdem ist es nicht wirklich kompliziert, <c>postfix</c> und <c>mutt</c> entsprechend zu konfigurieren. Editieren Sie die <path>/etc/postfix/main.cf</path> und entkommentieren Sie <i>home_mailbox</i> und <i>mail_spool_directory = /var/spool/mail</i>. Das mail spool-Verzeichnis erstellen Sie mit <c>mkdir -p /var/spool/mail</c>, danach starten Sie <c>postfix</c> neu. Danach m&#252;ssen Sie noch Ihr Mailprogramm anpassen, f&#252;r <c>mutt</c> m&#252;ssen Sie nur die Datei <path>/etc/mutt/Muttrc</path> &#228;ndern, sodass <e>mbox</e> mit <i>set mbox_type = mbox</i> benutzt wird und das <path>/var/spool/mail</path>-Verzeichnis mit <i>set spoolfile=/var/spool/mail</i> gesetzt wird.</impo>
<p>
Wenn Sie einen GUI Mailclient vorziehen, installieren wir sp&#228;ter den webbasierten Mailserver Squirrelmail. Alternativ empfiehlt Daniel Robbins st&#228;rkstenst eine Kombination aus IMAP (welches wir sp&#228;ter f&#252;r Squirrelmail installieren) und dem KDE-Programm <c>kmail</c>. Das Programm kmail ist im Paket <path>kde-base/kdenetwork</path>:
</p>
<pre>
 # <i>emerge --search kdenetwork</i>
[ Results for search key : kdenetwork ]
[ Applications found : 1 ]

*  kde-base/kdenetwork
      Latest version Available:  2.2.2
      Latest version Installed:  2.2.2
      Description:  ${DESCRIPTION}Network
</pre>
<p>
Nachher installieren wir noch Ximians <e>Evolution</e> als unsere PIM-Software (Personal Information Management), inklusive PalmPilot-Support. Auch mit diesem Programm kann man excellent Mails empfangen und verschicken.</p>
</body>
</section>
</chapter>

<chapter>
<title>Drucken</title>
<section>
<title>Einfaches Drucken -- PDQ</title>
<body>
<p>
Auf einem einfachen System das ohne <c>samba</c> l&#228;uft, ist das PDQ printing system gut und simpel.
</p>
<pre>
# <i>emerge net-print/pdq</i>
# <i>xpdq</i>
</pre>
<p>
Klicken Sie einfach auf <path>Printer/Add printer</path> und f&#252;gen Ihren Drucker hinzu. Sollte Ihr Drucker dort nicht gelistet sein, so k&#246;nnen Sie mit Hilfe von <uri>http://www.linuxprinting.org</uri> die ben&#246;tigten Dateien bekommen. M&#246;glicherweise m&#246;chten Sie per Klick auf "Driver options" weitere Einstellungen f&#252;r <c>xpdq</c> vornehmen. Jeder als root unter <c>xpdq</c> installierte Drucker ist f&#252;r alle User verf&#252;gbar. Das ist auch schon alles, was zum Drucken n&#246;tig ist!
</p>
</body>
</section>
<section>
<title>Drucken mit Komfort -- CUPS</title>
<body>
<p>
CUPS ist ein viel gr&#246;&#223;erer print spooler und ist voll benutzbar f&#252;r einen gro&#223;en Druckerserver. Gl&#252;cklicherweise ist es sch&#246;n leicht zu konfigurieren, da die meisten Einstellungen &#252;ber CUPS' eingebauten Webserver m&#246;glich sind. Obwohl CUPS eigentlich ein System 5 print spooler ist (das bedeutet, es benutzt die <c>lp</c>-Serie von Befehlen), emuliert es auch alle <c>lpr</c>-Befehle.
</p>
<pre>
# emerge --pretend net-print/gimp-print-cups
These are the packages that I would merge, in order.
 
Calculating dependencies.. done!
[ebuild N  ] net-print/cups-1.1.10-r6 to /
[binary N  ] net-print/gimp-print-cups-4.1.1 to /
# emerge gimp-print-cups
# rc-update add cupsd default
 * cupsd added to runlevel default...
 * Caching service dependencies...         [ ok ] 
 * rc-update complete.
# /etc/init.d/cupsd start
Starting Common Unix Printing System...... [  ok  ]
# konqueror localhost:631
</pre>
<p>
Das Paket <c>gimp-print-cups</c> ist eine Sammlung von Druckertreibern; das CUPS-Paket ansich enth&#228;lt nur Treiber f&#252;r HP und Epson-Drucker. Das emergen von <c>gimp-print-cups</c> erstellt auch cups als eine Abh&#228;ngigkeit. Sobald cups fertig kompilliert ist, f&#252;gen wir es unserem Runlevel mit Hilfe von <c>rc-update</c> hinzu; danach starten wir den Daemon mit Hilfe des init Scripts.
</p>
<p>
Zur Konfiguration von cups ben&#246;tigen wir lediglich einen Webbrowser mit dem wir eine Verbindung zum cups-Webserver (localhost, port 631) herstellen. (Beachten Sie, dass der cups-Webserver lediglich Verbindungen mit localhost herstellt und <e>nicht</e> &#252;ber eines ethX-Ger&#228;te. Dadurch ist es nat&#252;rlich recht sicher, macht aber leider auch Fernadministration unm&#246;glich. F&#252;r diese muss man auf das Tool <c>lpadmin</c> zur&#252;ck greifen, was jedoch ein wahrer Alptraum ist. Gl&#252;cklicherweise kann man &#252;ber ein Terminal auf den Server zugreifen und die Konfiguration mit <c>lynx</c> ausf&#252;hren.) Nachdem Sie das Webinterface mit http://localhost:631 aufgerufen haben, klicken Sie auf "Do Administrative Tasks". Danach werden Sie nach einem Accountnamen inklusive Passwort gefragt; geben Sie hier entweder "root" (und das root-Passwort) ein, oder einen User in der Gruppe "lp" ein. Da der Webserver wie gesagt nur auf localhost l&#228;uft, brauchen Sie dich keine sorgen um die Sicherheit Ihres (root-)Passwortes zu machen, es wird nicht &#252;ber das Internet gesendet.
Um einen Drucker hinzuzuf&#252;gen, klicken Sie auf "Add Printer" und folgen den weiteren Anweisungen. Falls Sie dazu weitere Hilfe ben&#246;tigen, klicken Sie einfach auf "Help" und lesen das "Software Administrator's Manual". Sollte Ihnen der richtige Treiber fehlen, verweise ich hier nocheinmal auf die Seite <uri>http://www.linuxprinting.org</uri>.
</p>
</body>
</section>
</chapter>

<chapter>
<title>Samba</title>
<section>
<body>
<p>
Mit Samba k&#246;nnen Sie mit Ihrem Linux-Rechner Dateien mit Windows-Rechnern austauschen. F&#252;r mehr Informationen dazu k&#246;nnen Sie die <uri link="http://www.ibm.com/developerworks">Samba Artikel</uri> von Daniel Robbins lesen.

</p>
<pre>
# <i>emerge net-fs/samba</i>
# <i>rc-update add samba default</i>
# <i>cd /etc/samba</i>
# <i>cp smb.conf.example smb.conf</i>
# <i>nano -w smb.conf</i>
</pre>
<pre caption="smb.conf -- Arbeitsgruppe">
# workgroup = NT-Domain-Name or Workgroup-Name, eg: REDHAT4
   workgroup = MYGROUP <comment>[hier Ihre Arbeitsgruppe eintragen]</comment>
</pre>
<pre caption="smb.conf -- Drucken mit CUPS">
# It should not be necessary to specify the print system type unless
# it is non-standard. Currently supported print systems include:
# bsd, sysv, plp, lprng, aix, hpux, qnx
;   printing = bsd
    printing = cups
</pre>
<pre caption="smb.conf -- Verschl&#252;sselung">
# You may wish to use password encryption. Please read
# ENCRYPTION.txt, Win95.txt and WinNT.txt in the Samba documentation.
# Do not enable this option unless you have read those documents
  encrypt passwords = yes
</pre>
<p>
Ich pers&#246;nlich hab recht kleine Anspr&#252;che an Samba. Ich m&#246;chte lediglich Dateien zwischen Linux- und Windowsrechner austauschen und meinen Linuxrechner als Druckerserver (mit <c>cups</c>) benutzen. Nach der Installation ist es n&#246;tig, ein paar kleinere &#196;nderungen an <path>/etc/samba/smb.conf</path> auszuf&#252;hren. Die Variable <e>workgroup</e> muss mit der Arbeitsgruppe Ihres Windowsrechners &#252;bereinstimmen, <e>printing</e> muss <e>cups</e> anstatt <e>bsd</e> lauten und die Zeile <e>encrypt passwords = yes</e> muss entkommentiert werden. Windowsrechner benutzten standartm&#228;&#223;ig verschl&#252;sselte Passw&#246;rter, daher ist die letzte &#196;nderung n&#246;tig, um ohne "Herumhacken" an der Windows-Registrierung <comment>[nicht empfohlen]</comment> auf Windowsrechner zuzugreifen. Leider benutzt Windows eine andere Methode zur Verschl&#252;sselung als Linux, daher m&#252;ssen Sie eine seperates Passwort-Datei f&#252;r samba erstellen.   
</p>
<pre>
# <i>smbpasswd -a IhrUserName</i>
New SMB password:
Retype new SMB password:
Added user grant.
</pre>
<note>
Bevor ein Benutzer in sambas Passwort-Datei hinzugef&#252;gt werden kann, muss er in <path>/etc/passwd</path> stehen.
</note>
<p>
F&#252;r jeden Benutzer der auf Windowsrechner zugreifen soll, m&#252;ssen Sie den Befehl <c>smbpasswd</c> benutzen. Samba speichert seine Passw&#246;rter in der Datei <path>/etc/samba/private/smbpasswd</path>, welche beim ersten Aufruf von <c>smbpasswd</c> automatisch erstellt wird. 
</p>
<pre>
# <i>/etc/init.d/samba start</i>
Starting samba...        [  ok  ]
</pre>
<p>
Starten Sie samba, und Sie sollten nun von jedem Windowsrechner auf Ihr Home-Verzeichnis sowie freigegebene Drucker zugreifen k&#246;nnen. Falls Sie nicht darauf zugreifen k&#246;nnen, sollten Sie unter <path>/usr/share/doc/samba-2.2.3a/full_docs/textdocs/DIAGNOSIS.txt.gz</path> nach weiteren Hinweisen suchen.
</p>
</body>
</section>
</chapter>

<chapter>
<title>Apache und Squirrelmail Webmail</title>
<section>
<title>Apache mit SSL und PHP</title>
<body>
<p>Wir gehen nun mal davon aus, dass Sie eine statische IP-Adresse haben (oder einen Service wie dyndns f&#252;r Ihre dynamische IP-Adresse) und Ihre E-Mails schnell und effektiv von woanders abrufen m&#246;chten. Ich entschied mich f&#252;r die L&#246;sung Squirrelmail, das ich aus der Ferne mit einem Webbrowser benutzen kann.</p>
<p>Zuerst m&#252;ssen wir einen Webserver installieren; da fast alle den Apache benutzen, werden wir dies auch tun. Ausserdem installieren wir PHP4, da Squirrelmail ein PHP-Programm ist. Die weiter unten auftauchenden Versionsnummern weichen h&#246;chstverscheinlich von den Ihren ab, ersetzen Sie sie also durch Ihre versionen. F&#252;gen Sie die folgendenen Befehle also nicht per Copy und Past in Ihre Konsole ein!</p>
<pre>
# <i>emerge net-www/apache dev-lang/php net-www/mod_ssl</i>
# <i>ebuild /var/db/pkg/dev-lang/php-4.1.2-r7/php-4.1.2-r7.ebuild config</i>
# <i>ebuild /var/db/pkg/net-www/mod_ssl-2.8.8/mod_ssl-2.8.8.ebuild config</i>
# <i>nano -w /etc/apache/conf/apache.conf</i>
</pre>
<impo>Wenn Sie SSL-Unterst&#252;tzung wollen, so sollten Sie sicherstellen, dass Sie mod_ssl installiert haben. Wenn Sie Ihre E-Mails &#252;ber das Internet abrufen m&#246;chten, dann <e>wollen</e> Sie SSL!</impo>

<p>Sie sollten sich <path>/etc/apache/conf/apache.conf</path> anschauen, da Apache sehr anpassbar ist. Standartm&#228;&#223;ig ist das document root des Apaches (wo er als erstes nach HTML-Dateien schaut, wenn Sie sich zu http://www.servername.foo oder http://localhost verbinden) <path>/home/httpd/htdocs</path>; passen Sie es ruhig Ihren W&#252;nschen an.</p>
<pre caption="/etc/apache/conf/apache.conf">
# Do NOT add a slash at the end of the directory path.
#
DocumentRoot "/home/httpd/htdocs" <comment>(&#228;ndern Sie diese Zeile wie gew&#252;nscht)</comment>

</pre>
<pre>
# <i>rc-update add apache default</i>
 * apache added to runlevel default...
 * Caching service dependencies...               [ ok ]
 * rc-update complete.
# <i>nano -w /etc/conf.d/apache</i>
</pre>
<p>Benutzen Sie <c>rc-update</c> um Apache in den default runlevel hinzuzuf&#252;gen. Danach editieren Sie <path>/etc/conf.d/apache</path> und f&#252;gen die folgenden Zeilen hinzu, sodass der Apache beim Starten die SSL- und PHP-Module l&#228;d.</p>
<pre caption="/etc/conf.d/apache">
APACHE_OPTS="-D SSL -D PHP4"
</pre>
<pre>
# <i>/etc/init.d/apache start</i>
 * Starting Apache...                            [ OK ]
# <i>lynx localhost</i>
</pre>
<p>Um zu schauen, ob Ihr Apache Webserver funktioniert, rufen Sie einfach mit einem Browser <uri>http://localhost auf</uri>. Wenn Sie testen m&#246;chten, ob auch SSL funktioniert, rufen Sie <uri>http<comment>s</comment>://localhost</uri> auf. Grafische Browser (wie Konqueror oder Mozilla) haben irgendwo ein Schloss-Symbol, was die sichere Verbindung per SSL anzeigt.</p>

<note>Wenn Sie eine sicher Verbindung zu Ihrem Server hinzuf&#252;gen, sollten Sie eine Warnung erhalten, dass das Zertifikat der Seite nicht erekannt worden ist. Das mod_ssl-Ebuild installiert ein selbst unterzeichnetes Zertifikat, welches nur f&#252;r Testzwecke benutzt werden sollte. Weiter Informationen erhalten Sie im <c>mod_ssl</c> Handbuch unter <uri>http://localhost/doc/mod_ssl-2.8.8/html</uri>.  F&#252;r privaten Gebraucht reicht dieses Zertifikat jedoch aus.</note>

<p>Nun stellen wir noch sicher, dass auch PHP korrekt funktioniert. Zuerst erstellen eine simple PHP-Datei im Apache Documentoot-Verzeichnis.</p>
<pre>
# <i>echo "&lt;? phpinfo(); ?&gt;" > /home/httpd/htdocs/test.php</i>
# <i>lynx http://localhost/test.php</i>
</pre>
<pre caption="working Apache + PHP">
                                                           phpinfo() (p1 of 26)
                                  PHP Logo
 
                             PHP Version 4.0.6
 
     System Linux my.server.edu 2.4.10 #1 Tue Oct 9 16:33:50 Local
           time zone must be set--see zic manuali686 i686 unknown
                           Build Date Oct 16 2001
</pre>
<p>Wenn Sie eine Ausgabe wie oben sehen, dann f&#252;hrt der Apache den PHP-Code korrekt aus.</p>
<warn>Wenn Sie sich die volle Ausgabe des Scriptes anschauen, dann werden Sie feststellen, dass es <e>eine Menge</e> an Informationen &#252;ber Ihr System verr&#228;t. M&#246;glicherweise st&#246;rt Sie das, also l&#246;schen Sie die Datei test.php oder machen Sie es wie ich: <c>mv test.php test.phps</c>. Apache zeigt Dateien mit Erweiterung .phps als Quellcode an, anstatt das Script auszuf&#252;hren.</warn>
</body>
</section>
<section>
<title>Courir IMAP</title>
<body>
<p>Squirrelmail ist eine PHP-Applikation, die jedoch einen IMAP-Server ben&#246;tigt. Da Gentoo Linux standartm&#228;&#223;ig das Maildir-Format benutzt, ist Courier IMAP eine gute Wahl.</p>
<pre>
# <i>emerge net-mail/courier-imap</i>
# <i>rc-update add courier-imapd default</i>
 * courier-imapd added to runlevel default...
 * Caching service dependencies...                        [ ok ]
 * rc-update complete.
# <i>nano -w /etc/courier-imap/authdaemonrc</i>
# <i>/etc/init.d/courier-imapd start</i>
# <i>telnet localhost 143</i>
Trying 127.0.0.1...
Connected to localhost.localdomain.
Escape character is '^]'.
* OK Courier-IMAP ready. Copyright 1998-2001 Double Precision, Inc.  
See COPYING for distribution information.
1 LOGIN IhrUserName IhrPasswort
1 OK LOGIN OK
<comment>(Dr&#252;cken Sie &lt;Strg&gt;-"]" und schreiben "quit" zum Beenden)</comment>
</pre>
<pre caption="Correct authorization in /etc/courier-imap/authdaemonrc">
##NAME: authmodulelist:0
#
# The authentication modules that are linked into authdaemond.  The
# default list is installed.  You may selectively disable modules simply
# by removing them from the following list.  The available modules you
# can use are: authcustom authcram authuserdb authpam

#authmodulelist="authcustom authcram authuserdb authpam"
authmodulelist="authpam"
</pre>
<impo>
Courier IMAP geht normalerweise in seinem rc start-up-Script <path>/usr/lib/courier-imap/imapd.rc</path> davon aus, dass das benutze Maildir in <path>$HOME/Maildir</path> liegt. Gentoo Linux benutzt jedoch$HOME/.maildir, daher modifiziert das courier-imap-Ebuild das <path>imapd.rc</path>-Script, sodass <e>$MAILDIR</e> aus dem init-Script <path>/etc/init.d/courier-imap</path> benutzt wird. Sollten Sie einen anderen Mailbox-Ordner als <path>.maildir</path> gew&#228;hlt haben, dann m&#252;ssen Sie den Eintrag <e>MAILDIR=.maildir</e> im init-Script von Courier IMAP anpassen.</impo>

<p>
Wenn Sie Courier IMAP mit SSL-Unterst&#252;tzung wollen, so m&#252;ssen Sir nur das IMAP SSL-Zertifikat erstellen (und Courier IMAP sagen, wo es zu finden ist)</p>

<pre>
# <i>/usr/sbin/mkimapdcert</i> 
</pre>
<p>und danach imap-ssl starten.</p>
<pre>
# <i>rc-update add courier-imapd-ssl default</i>
# <i>/etc/init.d/courier-imapd-ssl start</i>
</pre>
<p>Sie k&#246;nnen mit irgendeinem IMAP-f&#228;higen Mailclient wie Netscape, Kmail oder mutt pr&#252;fen, ob IMAP richtig funktioniert.</p>
<pre>
# <i>mutt -f imap://localhost</i>
</pre>
</body>
</section>
<section>
<title>Squirrelmail</title>
<body>
<p>Gl&#252;cklicherweise ist die Installation und Konfiguration sehr, sehr einfach, nachdem Sie die obigen Schritte bereits ausgef&#252;hrt haben.</p>
<pre>
# <i>emerge net-mail/squirrelmail</i>
# <i>cd /home/httpd/htdocs</i>
# <i>cd squirrelmail</i>
# <i>./configure</i>
</pre>
<note>Wenn Ihr Apache DocumentRoot nicht <path>/home/httpd/htdocs</path> ist, dann m&#252;ssen Sie das <path>net-mail/squirrelmail</path>-Ebuild entsprechend anpassen.</note>

<p>Damit Squirrelmail richtig funktioniert, m&#252;ssen Sie sicherstellen, dass alle seine Dateien dem User, unter dem Apache l&#228;uft, geh&#246;rt (das Squirrelmail-Ebuild geht davon aus, dass dieser Benutzer "apache" ist). Benutzen Sie <c>./configure</c> und w&#228;hlen Sie Option <e>2</e>.</p>
<pre caption="Squirrelmail Configuration -- Server settings">
SquirrelMail Configuration : Read: config.php
---------------------------------------------------------
Server Settings
1.  Domain               : my.server.edu
2.  IMAP Server          : localhost
3.  IMAP Port            : 143
4.  Use Sendmail/SMTP    : SMTP
6.    SMTP Server        : localhost
7.    SMTP Port          : 25
8.    Authenticated SMTP : false
9.  Server               : courier
10. Invert Time          : false
11. Delimiter            : detect
 
R   Return to Main Menu
C.  Turn color off
S   Save data
Q   Quit
 
Command >>
</pre>
<p>Stellen Sie sicher, dass <e>Server</e> auf <e>courier</e> gesetzt ist. Kehren Sie ins Hauptmen&#252; zur&#252;ck (<e>R</e>) und w&#228;hlen dann die Option <e>4</e>, General Options.</p>
<pre caption="Squirrelmail configuration -- General options">
SquirrelMail Configuration : Read: config.php
---------------------------------------------------------
General Options
1.  Default Charset        : iso-8859-1
2.  Data Directory         : ../data/
3.  Attachment Directory   : /tmp/
4.  Default Left Size      : 150
5.  Usernames in Lowercase : false
 
R   Return to Main Menu
C.  Turn color off
S   Save data
Q   Quit
 
Command >>
</pre>
<p>Ich benutze das Data Directory aus dem Paket, obwohl es sicherer w&#228;re, es ausserhalb des Apache Document-Trees zu haben. Ich benutze ausserdem <path>/tmp</path> als das Verzeichnis, wo meine Anh&#228;nge gespeichert werden.</p>

<p>Bevor wir Squirrelmail benutzen k&#246;nnen, m&#252;ssen wir zuerst die PHP Konfigurations-Datei <path>/etc/php4/php.ini</path> anpassen, und register_globals auf On schlaten;</p>
<pre>
# <i>nano -w /etc/php4/php.ini</i>
# <i>/etc/init.d/apache restart</i>
</pre>
<pre caption="Editieren von /etc/php4/php.ini">
; You should do your best to write your scripts so that they do not require
; register_globals to be on;  Using form variables as globals can easily lead
; to possible security problems, if the code is not very well thought of.
;register_globals = Off
<comment>register_globals = On</comment>
</pre>

<p>Nun k&#246;nnen Sie mit einem Browser <uri>https://localhost/squirrelmail/</uri>, und es sollte klappen!</p>
<pre>
# <i>lynx https://localhost/squirrelmail/</i>
</pre>
<pre caption="Squirrelmail Login-Seite">
                                           SquirrelMail - Login
                               [sm_logo.jpg]
 
                      SquirrelMail version 1.2.0 [rc2]
                    By the SquirrelMail Development Team
 
                             SquirrelMail Login
 
       Name: ____________________
   Password: ____________________
 
                                   Login
</pre>
<p>(Ich empfehle nicht wirklich, lynx mit Squirrelmail zu benutzen, aber Sie k&#246;nnen!)</p>
</body>
</section>
</chapter>

<chapter>
<title>Personal Information Management</title>
<section>
<title>Evolution mit Palm-Unterst&#252;tzung</title>
<body>
<p>Evolution ist ein ausnahmslos sch&#246;nes Personal Information Management-Tool, dass sich auch mit einem Palm Pilot abgleichen kann. Zuallererst m&#252;ssen wir Evolution emergen; wenn Sie die Palm-Unterst&#252;tzung benutzen m&#246;chten, sollten Sie vorher "pda" in Ihre USE-Variablen in <path>/etc/make.conf</path> eintragen.
</p>
<pre>
# <i>emerge --pretend net-mail/evolution</i>

These are the packages that I would merge, in order.

Calculating dependencies................................ done!
[ebuild N  ] app-text/ghostscript-6.50-r2 to /
[ebuild N  ] app-text/tetex-1.0.7-r4 to /
[ebuild   U] media-libs/freetype-2.0.5-r1 to /
[ebuild N  ] gnome-base/ORBit-0.5.12-r1 to /
[ebuild N  ] media-libs/giflib-4.1.0-r3 to /
[ebuild N  ] media-libs/imlib-1.9.10-r1 to /
[ebuild N  ] gnome-base/gnome-libs-1.4.1.2-r2 to /
[ebuild N  ] dev-libs/libxml-1.8.16 to /
[ebuild N  ] gnome-base/libglade-0.17-r3 to /
[ebuild N  ] media-libs/gdk-pixbuf-0.14.0 to /
[ebuild N  ] gnome-base/gnome-print-0.34 to /
[ebuild N  ] dev-libs/popt-1.5 to /
[ebuild N  ] dev-util/intltool-0.12 to /
[ebuild N  ] gnome-base/oaf-0.6.7 to /
[ebuild N  ] gnome-base/bonobo-1.0.17 to /
[ebuild N  ] dev-libs/libunicode-0.4-r1 to /
[ebuild N  ] dev-util/guile-1.5.4 to /
[ebuild N  ] gnome-base/gconf-1.0.7-r2 to /
[ebuild N  ] gnome-base/gnome-vfs-1.0.3 to /
[ebuild N  ] gnome-extra/gal-0.18.1 to /
[ebuild N  ] gnome-base/control-center-1.4.0.1-r3 to /
[ebuild N  ] dev-libs/pilot-link-0.9.6-r3 to /
[ebuild N  ] app-text/scrollkeeper-0.2 to /
[ebuild N  ] gnome-base/gnome-core-1.4.0.4-r3 to /
[ebuild N  ] gnome-extra/gnome-pilot-0.1.64 to /
[ebuild N  ] gnome-base/libghttp-1.0.9-r1 to /
[ebuild N  ] gnome-extra/gtkhtml-1.0.0 to /
[ebuild N  ] gnome-extra/bonobo-conf-0.14 to /
[ebuild N  ] app-arch/zip-2.3-r1 to /
[ebuild N  ] app-arch/unzip-5.42 to /
[ebuild N  ] net-www/mozilla-0.9.6-r4 to /
[ebuild N  ] net-mail/evolution-1.0-r2 to /

# <i>emerge net-mail/evolution</i> 
</pre>
<p>
Leider braucht das Kompillieren von Evolution sehr, sehr viel Zeit (beachten Sie, das <c>mozilla</c> eine Abh&#228;ngigkeit ist!); Sie k&#246;nnen w&#228;hrend des Wartens einige Liter Kaffee oder Tee drinken...
</p>
<p>
Durch des kompillieren von <c>evolution</c> sollten auch die n&#246;tigen Palm Pilot-Tools installiert worden sein. Um sicherzustellen, dass normale Benutzer sich mit einem Palm Pilot abgleichen k&#246;nnen, m&#252;ssen wir einige &#196;nderungen an den Serial-Port-Rechten durchf&#252;hren. Ich gehe jetzt mal davon aus, dass Ihr Palm an den ersten Serial-Port angeschlossen wird (/dev/ttyS0 order /dev/tts/0 in der "devfs"-Notation).
</p>
<pre>
# <i>groupadd serial</i>
# <i>chown root.serial /dev/tts/0</i>
# <i>chmod g+rw /dev/tts/0</i>
# <i>ls -l /dev/tts/0</i>
crw-rw----    1 root     serial     4,  64 Dec 31  1969 /dev/tts/0
# <i>ln -s /dev/tts/0 /dev/pilot</i>
# <i>nano -w /etc/group</i> <comment>(f&#252;gen Sie weitere Benutzer in die Gruppe "serial" hinzu)</comment>
</pre>
<p>
Wir haben die Gruppe "serial" dem System hinzugef&#252;gt, und sollten nun alle Benutzer die den Serial-Port benutzen (alle Palm Pilot-Benutzer) dieser Gruppe hinzuf&#252;gen. Wir gaben der Grupe "rw"-Rechte (lesen/schreiben) auf <path>/dev/tts/0</path>, und f&#252;r sp&#228;ter haben wir einen SymLink von <path>/dev/pilot</path> auf <path>/dev/tts/0</path> erstellt.  Dank einiger &#196;nderungen in devfs sind diese Einstellungen auch nach einem Neustart noch vorhanden.</p>
<note>
Benutzer von pre-rc6-r13 k&#246;nnen entweder <path>sys-apps/baselayout</path> und <path>sys-apps/devfsd</path> upgraden (und dadurch alle  "._cfg*"-Dateien in <path>/etc</path> einbinden), oder einfach die entsprechenden Rechte inklusive einem SymLink in <path>/etc/devfsd.conf</path> setzen.
</note>
<p>
Die Benutzer sollten danach die Men&#252;-Option <path>Tools/Pilot settings</path> in Evolution benutzen, um die Gnome Pilot Software zu installieren. Vergessen Sie auch nicht, die "Pilot Conduits" und den "Pilot Link" im Gnome Control Center einzustellen.
</p>
</body>
</section>
</chapter>
</guide>
