<?xml version='1.0'?>
<!DOCTYPE guide SYSTEM "../../../dtd/guide.dtd">
<guide link="/doc/nano-basics-guide.html">

<title>Nano Grundlagen</title>

<author title="Gentoo Doc Editor"><mail link="meekrob@gentoo.org">Sherman Boyd</mail></author>
<author title="&#220;bersetzung"><mail link="scandium@gentoo-linux.net">Rainer Groesslinger</mail></author>

<abstract>Das hier ist eine simple Einf&#xFC;hrung in nano. Damit Sie schnell mit den Grundlagen vertraut werden.</abstract>

<version>1.0</version>
<date>15 April 2002</date>

<chapter>
<title>Nano Grundlagen</title>
<section>
<title>Zweck</title>
<body>
<p>
Diese Hilfe wurde geschrieben, um grundlegende Aktionen mit nano zu umfassen. Mehr Informationen &#xFC;ber nano finden Sie hier:
</p><p>
<uri>http://www.nano-editor.org</uri>
</p>
</body>
</section>

<section>
<title>&#xD6;ffnen und erstellen von Dateien</title>
<body>
<p>
Das &#xD6;ffnen und Erstellen von Dateien ist in nano sehr einfach, geben Sie einfach folgendes ein: <pre># <i><c>nano filename</c></i></pre>Nano ist 
ein Editor ohne Modus, Sie k&#xF6;nnen also sofort Text einf&#xFC;gen. Wenn Sie eine Konfigurationsdatei wie z.b. <path>/etc/fstab</path> bearbeiten, 
dann benutzen Sie die Option -w z.B. <pre># <i><c>nano -w /etc/fstab</c></i></pre><warn>Es ist sehr wichtig, dass Sie die Option -w benutzen, wenn Sie 
eine Konfigurationsdatei &#xF6;ffnen. Wenn Sie dies vergessen, k&#xF6;nnte das Ihr System davon abhalten zu booten oder andere sch&#xE4;dliche 
Dinge anrichten.</warn> </p>
</body>
</section>

<section>
<title>Ausschneiden und Einf&#xFC;gen</title>
<body>
<p>
Um eine einzige Zeile auszuschneiden benutzen Sie <c>^K</c>. Sie halten einfach die Tasten <c>CTRL</c> und <c>k</c> zur selben Zeit gedr&#xFC;ckt.
Die Zeile verschwindet nun. Um Sie wieder einzuf&#xFC;gen, bewegen Sie den Cursor einfach dahin, wo Sie sie wieder einf&#xFC;gen wollen und dr&#xFC;cken
<c>^U</c> (<c>CTRL u</c>) auf der Tastatur.  BAM!  Die Zeile ist wieder da. Gehen wir davon aus, Sie m&#xFC;ssen einen ganzen Paragraphen bewegen.
Um mehrere Zeilen zu bewegen, schneiden Sie einfach jede Zeile einzeln aus und f&#xFC;gen Sie dann wieder ein.  BAM! 
Der komplette Paragraph erscheint an dieser Stelle.</p>
<p>
Wenn Sie eine etwas feinere Kontrolle haben wollen, dann m&#xFC;ssen Sie den Text markieren. Bewegen Sie den Cursor an den Anfang des Textes wo sie zu 
schneiden beginnen wollen. Dr&#xFC;cken Sie dann <c>^^</c> (Das ist <c>ctrl ^</c> oder <c>ctrl 6</c>).  
Bewegen Sie nun den Cursor an das Ende des Textes der ausgeschnitten werden soll. Der gew&#xFC;nschte Text sollte nun aufleuchten.
Wenn Sie die Markierung r&#xFC;ckg&#xE4;ngig machen wollen, dr&#xFC;cken Sie einfach wieder <c>^^</c>.
Dr&#xFC;cken Sie <c>^K</c> um den Text auszuschneiden.
Benutzen Sie <c>^U</c> um Ihn einzuf&#xFC;gen.  BAM!  Nun funktioniert es.
</p>
</body>
</section>

<section>
<title>Nach Text suchen</title>
<body>
<p>
Nach einem  string zu suchen ist einfach, solange Sie an <em>"WhereIs"</em> anstatt an <em>"Search"</em> denken. Dr&#xFC;cken Sie einfach <c>^W</c> 
(<c>CTRL w</c>) und geben Sie den string ein. Wie ich sagte, einfach.</p>
</body>
</section>

<section>
<title>Zusammenfassung</title>
<body>
<p>
Das ist alles!  Danke an kiyose und quazion aus #gentoo. Um mehr Informationen &#xFC;ber nano zu bekommen schauen Sie hier:
</p><p>
<uri>http://www.nano-editor.org</uri>
</p>
</body>
</section>
</chapter>
</guide>

 
