<?xml version='1.0'?>
<?xml-stylesheet href="/xsl/guide.xsl" type="text/xsl"?>

<!DOCTYPE guide SYSTEM "/dtd/guide.dtd">

<guide link="/doc/de/altinstall.xml">
<title>Das Gentoo Linux alternative Installations Methoden HOWTO</title>
<author title="Autor"><mail link="lordviram@rebelpacket.net">Travis Tilley</mail></author>
<author title="&#xDC;bersetzung"><mail link="egbers@netzraum.com">Sebastian Egbers</mail></author>
<author title="&#220;bersetzung"><mail link="sebastian@beneke-it.de">Sebastian Beneke</mail></author>
<abstract>
Dieses HOWTO soll eine Art Fundgrube von alternativen Gentoo Installations-
Methoden werden, f&#xFC;r die, die spezielle Installations Anforderungen haben,
wie kein CD-ROM oder ein Computer der keine CDs bootet.
</abstract>

<version>0.1-de</version>
<date>5. Juli 2002</date>

<chapter>
<title>&#xDC;ber dieses Dokument</title>
<section>
<body>
       <p>
       Wenn die Standard Boot-von-CD Installation f&#xFC;r Sie nicht funktioniert
       (oder Sie sie einfach nicht m&#xF6;gen), ist nun Hilfe verf&#xFC;gbar.
       Dieses Dokument soll eine Sammlung verschiedener alternativer Installations 
       Methoden bieten. Sollten Sie eine alternative Installations Methode kennen, 
       von der Sie meinen, da&#223; sie auch f&#252;r andere hilfreich sein k&#246;nnte, z&#246;gern Sie 
       bitte nicht <mail link="lordviram@rebelpacket.net">mir zu schreiben</mail> 
       (Englisch), bzw. sich an das <mail link="gentoo-deutsch-dev@lists.berlios.de">
       Team von Gentoo.de</mail> zu wenden.
       </p>
</body>
</section>
</chapter>

<chapter>
<title>Netboot Installation</title>
<section>
<title>Voraussetzungen</title>
<body>
<p>Die Voraussetzungen f&#xFC;r eine Netboot Installation sind ein Ziel-Computer,
wo ein tftp-Server l&#xE4;uft, und ein Computer, der sich selber via netboot
entweder vom BIOS oder von Diskette aus, wo GRUB oder ein anderer
Netzwerk-Bootloader installiert ist, vom Netzwerk bootet. Ein dhcp-Server ist unter Umst&#xE4;nden
ebenfalls n&#xF6;tig. Nat&#xFC;rlich brauchen wir auch das aktuellste ISO, das unter
<uri>http://www.ibiblio.org/gentoo/snapshots/build/</uri> gefunden werden kann.
</p>
</body>
</section>

<section>
<title>&#xDC;berblick</title>
<body>

<p>Als erstes muss die Netboot-Maschine eine IP Adresse beziehen, bevor es das
Image aus dem Netzwerk ziehen kann. Es gibt mehrere M&#xF6;glichkeiten, um an
eine IP-Adresse zu kommen, und jede wird gen&#252;gen. Pers&#xF6;nlich bevorzuge
ich GRUB f&#xFC;r alles, aber wenn Ihr Computer bereits das Booten vom Netzwerk
unterst&#xFC;tzt, ist GRUB nicht unbedingt notwendig. Auch wenn es vielleicht
einfach ist GRUBs <c>ifconfig</c> Kommando zu verwenden, und keinen bootp
oder dhcp Server zu installieren.
</p>

<p>
Nachdem Ihr Computer eine IP Adresse bezogen hat folgt der n&#228;chste logische Schritt.
Sie m&#252;ssen herausfinden, was gebootet werden soll und wo es aufbewahrt wird.
Nat&#252;rlich w&#228;re es einfacher mit GRUB Kommandos zu arbeiten, anstatt einen BOOTP 
oder DHCP Server aufzusetzen. Au&#223;erdem m&#252;ssen Sie festlegen, wie eine Initrd erstellt 
werden soll und wie der Kernel diese als ROOT-Dateisystem verwenden soll.
</p>

<p>
Wenn Ihr Kernel geladen und das ROOT-Dateisystem gemountet wurde, k&#246;nnen Sie mit 
einer normalen Installation fortfahren. Das Installations Image kann entweder von CD 
geladen oder via tftp vom Netzwerk bezogen werden.
</p>

</body>
</section>
<section>
<title>GRUB verwenden</title>
<body>

<p>
Damit GRUB f&#252;r das Netzwerkbooten genutzt werden kann, muss es erst mit Unterst&#252;tzung 
f&#252;r Ihre Netzwerkkarte kompiliert werden. Dabei spielt es keine Rolle, ob Sie GRUB auf 
eine Diskette oder Festplatte installieren wollen. Sollte Ihr Installationsziel bereits 
&#252;ber ein GRUB mit Netzwerkunterst&#252;tzung verf&#252;gen, k&#246;nnen Sie beim n&#228;chsten Schritt fortfahren. 
GRUB kann von <uri>ftp://alpha.gnu.org/gnu/grub/</uri> heruntergeladen werden.
</p>

<p>Ein Konfigurations-Beispiel mit Tulip Unterst&#xFC;tzung, die Netzwerkkarte
in meinem Rechner:</p>

<pre caption="Manuelle GRUB Installation">
# <i>./configure --enable-tulip --prefix=/usr</i>
# <i>make &amp;&amp; make install</i>
</pre>

<p>
Sollten Sie sich bereits in Gentoo befinden und Sie den GRUB mit Netzwerkunterst&#252;tzung 
durch Gentoo-Tools installieren wollen, sollten Sie die folgenden Schritte genau 
befolgen. Ein Beispiel, um ein Ebuild zur Installation von GRUB mit Tulip Unterst&#252;tzung 
zu nutzen:
</p>

<pre caption="Installation und Konfiguration von GRUB unter Gentoo Linux">
# <i>ebuild /usr/portage/sys-apps/grub/grub-0.91.ebuild clean fetch unpack</i>
# <i>cd /var/tmp/portage/grub-0.91/work/grub-0.91/</i>
# <i>./configure --prefix=/usr --sbindir=/sbin --mandir=/usr/share/man \ </i>
> <i>--infodir=/usr/share/info --enable-tulip</i>
# <i>make</i>
# <i>touch /var/tmp/portage/grub-0.91/.compiled</i>
# <i>cd /usr/portage/</i>
# <i>ebuild sys-apps/grub/grub-0.91.ebuild install merge</i>
</pre>

<p>
Nachdem wir die GRUB Shell nun installiert haben, m&#252;ssen wir GRUB noch in einen 
Bootsektor installieren. Auch wenn Sie GRUB direkt in den Bootsektor der Festplatte 
Ihres Installations Systems installieren k&#246;nnten, gehen wir hier davon aus, dass die 
Installation auf eine Diskette erfolgt. Daf&#252;r gibt es zwei M&#246;glichkeiten. Sie k&#246;nnen 
zum einen direkt die GRUB Shell oder zum anderen ein mitgeliefertes Script, <i>grub-install</i> 
genannt, benutzen. Sie sollten <c>grub-install</c> zur Installation auf einer Diskette 
den Vorzug geben.
</p>

<pre caption="GRUB Installations Beispiel">
# <i>mkfs.ext2 /dev/fd0</i>
# <i>mount /dev/fd0 /mnt/floppy/</i>
# <i>grub-install --root-directory=/mnt/floppy/ '(fd0)'</i>
# <i>umount /mnt/floppy/</i>
</pre>

<p>
<c>grub-install</c> funktioniert nicht immer ... und ist nicht immer der beste Weg zur 
Installation. Da die GRUB Shell genauso arbeitet, wie GRUB beim Booten, k&#246;nnte es 
w&#252;nschenswert sein die GRUB Shell zu benutzen. Hier ist ein Beispiel zur Verwendung der 
GRUB Shell zur Installation von GRUB auf einer Diskette:
</p>

<pre caption="Benutzung der GRUB Shell">
# <i>mkfs.ext2 /dev/fd0</i>
# <i>mount /dev/fd0 /mnt/floppy/</i>
# <i>mkdir -p /mnt/floppy/boot/grub/</i>
# <i>cp -v /usr/share/grub/i386-pc/* /mnt/floppy/boot/grub/</i>
# <i>grub</i>
grub> <i>root (fd0)</i>
grub> <i>setup (fd0)</i>
grub> <i>quit</i>
# <i>umount /mnt/floppy/</i>
</pre>

<p>
Da wir nun eine bootf&#228;hige GRUB Diskette haben, m&#252;ssen wir nun einen tftp Server 
(ich schlage Netkit's TFTP Server vor) f&#252;r das Laden des Kernels und der Initrd 
aufsetzen. Sollten Sie Inetd nutzen, ben&#246;tigen Sie folgende Zeile in Ihrer 
<path>/etc/inetd.conf</path>: 
</p>

<pre caption="/etc/inetd.conf">
tftp	dgram	udp	wait	nobody	/usr/sbin/tcpd	in.tftpd
</pre>

<p>
Um den Netkit TFTP Server unter Gentoo Linux zu installieren, benutzen Sie 
"emerge net-misc/netkit-tftp".
</p>

<note>
Es gibt ein Ebuild f&#252;r Xinetd ... sollten Sie dieses bevorzugen, k&#246;nnen Sie es nat&#252;rlich 
ebenfalls verwenden. Auf jeden Fall benutz ich es nicht, daher wei&#223; ich auch nicht, wie 
man es mit tftp einrichtet. Sollten Sie es benutzten, w&#228;re es sehr freundlich von Ihnen, wenn Sie 
mir Details mailen k&#246;nnten. Dann k&#246;nnte ich dies in diesem Howto integrieren.
</note>

<p>
Da wir nun einen TFTP Server am Laufen haben, brauchen wir nur noch einen Kernel und eine 
ROOT-Initrd. Sie k&#246;nnen einen eigenen Kernel kompilieren, aber achten Sie darauf, dass dieser 
alle wichtigen Dinge, die f&#252;r das funktionieren von Gentoo Linux n&#246;tig sind (wie devfs und 
initrd f&#252;rs Netbooting), enth&#228;lt. Die ROOT-Initrd erstellt die Datei rescue.gz vom Gentoo ISO.
</p>

<impo>Zum Mounten einer ISO-Datei ohne sie zu brennen, wird die
Unterst&#xFC;tzung f&#xFC;r das Loopback-Dateisystem ben&#246;tigt.</impo>

<pre>
# <i>mkdir /tftpboot</i>
# <i>mount -o loop /path/to/build-ix86-1.0_rc6-r14.iso /mnt/cdrom/</i>
# <i>cp /mnt/cdrom/isolinux/kernel /mnt/cdrom/isolinux/rescue.gz /tftpboot</i>
# <i>chmod 644 /tftpboot/*</i>
# <i>umount /mnt/cdrom/</i>
</pre>

<p>
Booten Sie nun den Rechner auf dem Gentoo installiert werden soll mit Ihrer unglaublich 
n&#252;tzlichen GRUB Diskette. Nachdem Sie gebootet haben, m&#252;ssen Sie noch den Weg festlegen, 
wie die IP Adresse bezogen werden soll. Nun legen Sie noch fest woher der Kernel und seine Initrd 
bezogen werden sollen.
</p>

<pre>
grub> <i>ifconfig --address=192.168.0.10 --server=192.168.0.2</i>
grub> <i>root (nd)</i>
grub> <i>kernel /tftpboot/kernel devfs=nomount vga=normal load_ramdisk=1 </i>
      <i>prompt_ramdisk=0 ramdisk_size=24000 root=/dev/ram0 rw</i> <comment>(alles in eine Zeile)</comment>
grub> <i>initrd /tftpboot/rescue.gz</i>
grub> <i>boot</i>
</pre>

<note>Sie k&#xF6;nnen auch bootp und dhcp verwenden, um Ihre IP via GRUB zu
konfigurieren. Verwenden Sie die bootp und dhcpd Kommandos.</note>

<p>Jetzt wo Ihre Maschine gebootet ist, k&#xF6;nnen Sie wie immer installieren. Lesen Sie dazu im HOWTO 
zur Installation von CD weiter.
</p>

</body>
</section>
</chapter>
</guide>
