<?xml version='1.0'?>

<!DOCTYPE guide SYSTEM "/dtd/guide.dtd">

<guide link="/doc/de/faq.xml">
<title>Gentoo Linux Frequently Asked Questions</title>
<author title="Leitender Architekt"><mail link="drobbins@gentoo.org">Daniel Robbins</mail></author>
<author title="Reviewer">Colin Morey</author>
<author title="&#xDC;bersetzer"><mail link="marko@nexboard.de">Marko Kercmar</mail></author>
<author title="&#xDC;bersetzer"><mail link="egbers@netzraum.com">Sebastian Egbers</mail></author>
<author title="&#xDC;bersetzer"><mail link="js@ameds.de">Jens Schittenhelm</mail></author>
<abstract>Diese FAQ ist eine Sammlung von Fragen und Antworten gesammelt in der gentoo-dev Mailingliste und aus dem IRC -- Wenn du andere Fragen (oder Antworten!) zum hinzuf&#xFC;gen hast, bitte kontaktiere einen Autor oder ein Mitglied vom Dokumentations Team.</abstract>

<version>1.1.1-de</version>
<date> Juli 2002</date>

<chapter>
	<title>Gentoo allgemein</title>

	<section>
		<title>Wie wird Gentoo ausgesprochen, und was ist damit gemeint?</title>
		<body><p>Gentoo ist eine Art von kleinen schnellen Pinguinen, ausgesprochen "schen-tuu".</p></body>
	</section>

	<section>
		<title>Was ist an Gentoo anders?</title>
		<body>
			<p>Gentoo Linux ist eine schnelle, moderne Distribution mit einem sauberen und flexiblen
			Design -- in dieser Hinsicht kann Gentoo
			<uri link="http://www.slackware.com/">Slackware</uri>,
			<uri link="http://www.linuxfromscratch.org">Linux From Scratch</uri> oder
            <uri link="http://www.bsd.org">BSD</uri> Benutzern gefallen. Anders als die meisten Linux
            Distributionen, hat Gentoo ein Paket System, das an die "Ports" von BSD erinnert;
            wir meinen, Sie k&#xF6;nnen sich immer sicher sein das Sie immer die aktuellsten Versionen der Pakete haben.
        </p></body> 	</section> </chapter>

<chapter>
	<title>Installation</title>

	<section>
		<title>Wo ist der Unterschied zwischen .iso und .tbz2 Dateien?</title>
		<body><p>Die fertigen <e>.tbz2</e> Dateien sind ein Minimal-Archiv von System Dateien
		die den Benutzern den bootstrap und die Installation von Gentoo Linux erlauben.
		Die Fertige <e>.iso</e> ist eine komplettes, bootf&#xE4;higes CD Image das
		einen System Kernel, einen zum Teil komplette Zusammenstellung von Kernel Modulen,
		wichtigen System Hilfsprogrammen wie <c>mkfs</c> und Netzwerk Unterst&#xFC;tzung,
		sowie das Minimal-System des <e>.tbz2</e> Archivs enth&#xE4;lt. Die meisten Benutzer werden
		Gentoo Linux von der .iso Datei auf eine CD brennen, von der CD booten,
		und mit einer Minimalen Linux Umgebung von der Gentoo Boot CD Installieren.
		Es ist f&#xFC;r den Benutzer jedoch m&#xF6;glich Gentoo Linux direkt von einer
		bereits vorhandenen Linux Distribution zu Installieren.
		Solche Benutzer m&#xFC;ssen nur eine .tbz2 Datei downloaden,
		den Inhalt auf eine Reserve Partitionen entpacken
		(stellen Sie sicher das Sie das <c>p</c> Argument benutzen wenn Sie das Archiv entpacken),
		dann in das System einen chroot ausf&#xFC;hren und &#xFC;ber normale Art und Weise installieren.</p>
        </body>
	</section>

	<section>
		<title>Warum werden .iso und .tbz2 Dateien mit Unterschiedlichen -r (Revisionen) erstellt/ver&#xF6;ffentlicht?</title>
		<body><p>
		Das Minimal-System aus dem .tbz2 Archiv braucht nur erneuert zu werden, wenn signifikante &#xC4;nderungen am Kern
		von Gentoo Linux gemacht wurden (z. B. &#xC4;nderungen am Basislayout oder ein neues Profil) - dadurch sind .tbz2
		Updates relativ selten.
		<!-- Blub.. Was fuer ein Satz.. Keine Ahnung, mal ueberlegen -->
		<!-- Nicht schoen aber ok -S.E -->
		<!--The .tbz2 minimal-system tarball only needs to be revised when there have
		been significant changes to the core Gentoo Linux system (such as baselayout
		changes, or a new profile), and as such .tbz2 updates are relatively rare.//-->
		<!-- Das kann ich wieder -->
		Die .iso Datei muss nur aktualisiert werden, wenn jemand andere Hardware hat
		die nicht mit der .iso booten will. Seitdem Aktualisierungen der Kernel Module und Updates
		regelm&#xE4;ssig gemacht werden kann es nur selten zu dieser Situation kommen.
		</p>
	</body>
	</section>

<!--  Commenting out since this is really out of date now (can i remove this now? - Colin Morey)
	<section>
		<title>How do I install with no ISO image?</title>
		<body><p>We are working out a solution for 1.0_rc6+ systems as we speak.  Stay tuned and visit the <uri
link="/doc/build.html">Download/Install page</uri> for updates.</p> 
	</body>
	</section>
-->

	<section>
		<!-- Is des Deutsch "," + "und" danach -->
		<title>Ich habe einen Sony Super-Slim VAIO Laptop, und die Gentoo Linux CD hat Probleme
			beim erkennen meines PCMCIA ATAPI CD-ROM Laufwerkes.</title>
		<body>
		<p>Gehen sie sicher, das der zweite IDE Port f&#xFC;r das CDROM Eingestellt ist (es setzt sich selbst
		zur&#xFC;ck wenn das Laufwerk nicht	beim Booten angeschlossen ist) und dann geben Sie folgendes bei
		Isolinux <c>boot:</c> ein:</p>
<pre>
boot: <i>rescue ide2=0x180,0x386</i>
</pre>
<p>Wenn sie 1.0_rc5 oder eine &#xE4;ltere Boot CD benutzen, abgesehen vom runterladen einer neuen ISO,
geben Sie oben <c>gentoo</c> anstatt <c>rescue</c> ein.</p>
</body>

</section>
	<section>
		<title>Mir erscheint das ganze sehr instabil und ich benutzte "-O9 -ffast-math
		-fomit-frame-pointer" optimierungen. Warum?</title>
		<body>
		<p>Bei Optimierungen &#xFC;ber <c>-O3</c> hinaus, ist das Risko hoch, dass einzelne Pakete
		nicht mehr funktionieren. Sehr agressive Optimimierungen k&#xF6;nnen den Assembler Code
		insoweit bis zu einem Punkt ver&#xE4;ndern, wo er nicht mehr das tut, was eigentlich von ihm
		erwartet wird. <e>Loc-Dog</e> (im IRC)benutzt <c>-O3 -mcpu=i686 -march=i686 -fforce-addr
		-fomit-frame-pointer -funroll-loops -frerun-cse-after-loop -frerun-loop-opt -malign-functions=4</c>,
		um sein System so weit es geht im Bereich des noch tragbaren zu optimieren. Dar&#xFC;ber hinaus
		sollten ultra-hohe Optimierungen nur noch bei einzelnen Paketen angewendet werden, wo die
		Leistungssteigerung um 2% noch gerechtfertigt ist (Graphik und verschiedene Multimedia-Programme)
		auch, um die jeweiligen Pakete noch testen zu k&#xF6;nnen und sicherzustellen, dass sie nicht bis in
		den Status des Vergessens optimiert wurden.</p>
		</body>
	</section>

	<section>
		<title>Wie lautet das Standard Root Passwort nach der Installation?</title>
		<body><p>Das Standard Passwort ist leer, einfach Enter dr&#xFC;cken.</p></body>
	</section>

	<section>
		<title>Wie kann ich bei root (oder einem anderen User) das Passwort &#xE4;ndern?</title>
		<body><p>Sie k&#xF6;nnen <c>passwd</c> benutzen, um das Passwort f&#xFC;r den User mit dem sie angemeldet sind zu &#xE4;ndern.
		F&#xFC;r zus&#xE4;tzliche Optionen und Einstellungen, schauen Sie sich bitte <c>man passwd</c> an, nachdem sie Gentoo Linux
		fertig Installiert haben.
		</p></body>
	</section>
	<section>
		<!-- Habe mal user eingedeutscht ;-) wenn nicht ok, nehm ichs gerne wieder raus (JS)-->
		<!-- Okay! (MK) -->
		<title>Wie kann man einen normalen Benutzer hinzuf&#xFC;gen?</title>
		<body>
		<p>Jeder weiss wohl, das es nicht sehr empfehlenswert ist immer <e>root</e> zu benutzen.
		Wie kann man also andere Benutzer hinzuf&#xFC;gen?</p>
		<p>Der Befehl <c>adduser gentoo</c> w&#xFC;rde einen Benutzer mit dem Usernamen gentoo erstellen. Der n&#xE4;chste Schritt ist,
		diesem User ein Password zu geben und <c>passwd</c> tut genau das.</p>
		</body>
	</section>
	<section>
		<title>Warum kann ein Benutzer nicht mit su zu root werden?</title>
		<body><p>Aus Sicherheitsgr&#xFC;nden k&#xF6;nnen Benutzer nur mit <c>su</c> zu root werden, wenn sie in der
		<e>wheel</e> Groupe sind. Um einen <i>Usernamen</i> zu der <e>wheel</e> Gruppe hinzuf&#xFC;gen, benutzen sie den 
		folgenden Befehl als root:</p>
		<pre># <i>usermod -G users,wheel username</i></pre>
		</body>
	</section>
	<section>
		<title>Wie kann ich devfs aktivieren?</title>
		<body>
		<p>
		Wenn Sie 1.0_rc5 oder neuer benutzen, braucht man nichts machen um devfs
		zu aktivieren: es ist schon aktiviert (Haben sie auch devfs in den Kernel eingebunden?).
		Wie immer
		Wenn sie jedoch, eine Version von Gentoo Linux <e>vor</e> der Version 1.0_rc5 benutzen, f&#xFC;gen sie bitte
		<c>devfs=mount</c> zu Ihrer <c>GRUB</c> Kernel Boot Option hinzu, so das die Zeile zum Teil so aussieht wie
		<c>kernel /boot/boot/bzImage devfs=mount foo=bar</c>  Der Kernel wird auf
		<path>/dev</path> das <e>devfs</e>  Dateisystem automatisch booten.
		</p>
		</body>
	</section>
	<section>
		<title>Wie kann ich devfs deaktivieren?</title>
		<body>
		<p>Bei Gentoo Linux 1.0_rc6 und neuer, kann man devfs deaktivieren durch das &#xFC;bergeben des
		<c>gentoo=nodevfs</c> Argumentes zum Kernel.</p>
		</body>
	</section>
	<section>
		<!-- korrekt &#xFC;bersetzt? (JS)-->
		<title>Wie erhalte ich ein <path>/dev/mouse </path> das nach dem Booten nicht
		wieder verloren geht (bei Benutzung von devfs)?</title>
		<body>
		<p>
		Ab Version 1.0_rc6 oder sp&#xE4;ter, es gen&#xFC;gt einfach <c>ln -s</c>
		um einen gewohnten symbolischen link von <path>/dev/mouse</path> zu
		erstellen, welcher auch zwischen Neustarts erhalten bleibt.
		</p>
		<p>Alle anderen benutzer sollten Ihre <path>/etc/devfsd.conf</path>
		editieren und folgende Zeilen hinzuf&#xFC;gen:</p>
<pre>
REGISTER        ^misc/psaux$    CFUNCTION GLOBAL symlink misc/psaux mouse
UNREGISTER      ^misc/psaux$    CFUNCTION GLOBAL unlink mouse
</pre>
		<p>Benutzen Sie eine andere Maus, als die standardm&#xE4;ssig vorgegebene devfs PS/2 Maus 
		unter <path>/dev/misc/psaux</path>, sollten die <c>misc/psaux</c> Zeilen entsprechend
		abge&#xE4;ndert werden. Anschliessend sollte noch <c>killall -HUP devfsd</c> ausgef&#xFC;hrt werden,
		um die Pfadangaben in <path>/etc/devfsd.conf</path> erneut einzulesen.</p>
		</body>
	</section>
	<section>
		<title>Grub kann die stage x.y nicht finden?</title>
		<body><p>
		W&#xE4;hrend der Installation hat grub die boot Dateien
		nach <path>/boot/grub</path> (<path>/boot/boot/grub</path> in Gentoo Linux 1.0_rc5 und 
		&#xE4;lter) kopiert. Grub sucht automatisch das Verzeichnis <path>/boot/grub</path> auf der Boot Partition ab.
		(Wir empfehlen zur Sicherheit die boot Partition auf <path>/boot</path> nicht automatisch zu mounten,
		da es so schwieriger ist aus Versehen den Kernel oder die Boot-Informationen zu zerst&#xF6;ren ).
		Der obige Fehler tritt deshalb meistens auf, wenn (a) /boot nicht auf einer separaten Partition installiert wird,
		oder (b) durch Vergessen des mounten der Boot Partition auf <path>/boot</path> bevor man das
		Minimal-System Archiv entpackt hat oder <c>emerge --usepkg system</c>, oder (c) vergessen des
		<c>notail</c> Argumentes when <path>/boot</path> eine ReiserFS Partition ist.
		Sie k&#xF6;nnen mehr Informationen &#xFC;ber Grub in der Debug Anleitung finden, die in der Standard
		Installation vorhanden ist. Dazu geben Sie einfach <i>debug grub</i> von dem Grub Terminal oder lesen Sie das
		<uri link="http://www-105.ibm.com/developerworks/education.nsf/linux-onlinecourse-bytitle/0F1731DC664023B7862569D0005C44AF?OpenDocument">IBM developerWorks Grub tutorial</uri>.
		</p>
                </body>
	</section>
</chapter>

<chapter>
	<title>Paket Verwaltung</title>
	<section>
		<title>In welchem Format werden die Pakete gespeichert?</title>
		<body><p>Die Pakete existieren in unserem Portage "Baum/Stammbaum/Archiv" als <e>ebuild</e>, den Installations Skripten. 
		Wir sind hauptsaechlich eine Ports-basierende Distribution, darunter versteht man, dass wir Skripte (<c>.ebuild</c> Dateien) und ein
		spezielles System (Portage) bereitstellen, damit man die Programme bequem aus dem Quellcode bauen kann. Wir erstellen normalerweise 
		Bin&#xE4;re Pakete nur f&#xFC;r spezielle Veroeffentlichungen und "snapshots". Die <uri link="/doc/gentoo-howto.html">Development HOWTO
		</uri> erkl&#xE4;rt den Inhalt von ebuild Skripten.  Fuer eine komplette Bin&#xE4;re ISO Veroeffentlichung, erstellen wir
		eine komplette Umbegung in einer weiterentwickelten Version des <c>.tbz2</c> Datei Formates (<c>.tar.bz2</c> -
		(kompatibel mit Meta-Information, die am Ende der Datei gespeichert sind)</p>
		</body>
	</section>

	<section>
		<!-- brr, ein schrecklicher Satz (JS)-->
		<title>Warum ein neues Port System schreiben (Portage), wenn man die BSD Version verwenden k&#xF6;nnte?</title>
		<body>
		<p>In einem Satz: Weil Portage in vielen Dingen viel besser ist. Eine der Entwicklungsphilosophien
		von der <c>.ebuild</c> Syntax ist die Analogie zu dem, was Sie an der Kommandozeile eingeben w&#xFC;rden,
		um die Pakete von Hand zu installieren. Somit sollte Portage sehr einfach zu erlernen sein und auch
		ohne grossen Aufwand an die eigenen Bed&#xFC;rfnisse angepasst werden k&#xF6;nnen. Wir haben auch "gef&#xE4;lschte"
		Installationen im OpenBSD-Stil, sicheres entfernen, Systemanpassungen, Paketmaskierung, ein echtes
		System, welches Abh&#xE4;ngigkeiten ber&#xFC;cksichtigt und noch viele andere guten Sachen.</p>
		</body>
	</section>

	<section>
		<title>Wo liegt der Unterschied zu Debian's apt oder den BSD Ports?</title>
		<body><p>Portage enth&#xE4;lt die besten Funktionen von apt und ports; zum Beispiel die
		USE Optionen, ein komplettes Abh&#xE4;ngigkeitssystem, sicheres installieren und
		deinstallieren, eine wirkliche Paket-Datenbank. Stellen Sie sich Portage als das Beste
		beider Welten vor; ein Ports-System das die sensibilit&#xE4;t und sicherheit eines Linux
		Paket Management Systems enth&#xE4;lt.</p></body>
	</section>

	<section>
	        <title>Wie installiere und deinstalliere ich Pakete?</title>
	        <body>
		<p>Das <uri link="/doc/portage-user.html">Portage User Guide</uri> erkl&#xE4;rt ausf&#xFC;hrlich, wie man 
		Pakete installiert, deinstalliert und Portage aktualisiert.</p>
	        </body>
	</section>

	<section>
		<!-- kompilieren mit c oder k ?? (JS)-->
		<!-- Deutsch: k (MK) -->
		<title>Wie kann ich globale Einstellungen zum kompilieren der Pakete einstellen?</title>
		<body><p><path>/etc/make.conf</path> kann editiert werden, um globale und profil-spezifische
		Standardeinstellungen zu &#xFC;berschreiben, die beim kompilieren und einf&#xFC;hren der Pakete verwendet werden.
		Die am meisten &#xFC;blichen Befele sind folgende:</p>
		<table>
		<tr>
			<th>Flag</th>
			<th>Beschreibung</th>
		</tr>
		<tr>
			<ti>CHOST</ti>
			<ti>Dies setzt die HOST Variable f&#xFC;r Compiler, z.B. <c>i686-pc-linux-gnu</c></ti>
		</tr>
		<tr>
			<ti>CFLAGS</ti>
			<ti>Die Optionen f&#xFC;r den <c>gcc</c> zum kompilieren von Programmen, die in C (*.c Dateien) geschrieben sind</ti>
		</tr>
		<tr>
			<ti>CXXFLAGS</ti>
			<ti>Die Optionen f&#xFC;r den <c>gcc</c> zum kompilieren von Programmen, die in C++ (*.c,*.cpp etc.
			Dateien) geschrieben sind</ti>
		</tr>
		<tr>
			<ti>USE</ti>
			<ti>Dies Erlaubt das Setzen von gew&#xFC;nschten Komponenten, die mit hinein kompiliert
			werden sollen, sofern diese vorhanden sind. Zum Besipiel, wenn Sie <c>gnome</c> innerhalb
			der USE Zeile haben, und Sie <c>xchat</c> kompilieren, wird dies die Gnome Unterst&#xFC;tzung
			von xchat hinzuf&#xFC;gen. Auch alle Paket-Abh&#xE4;ngigkeiten machen von den Ver&#xE4;nderungen in der
			USE-Zeile Gebrauch.</ti>
		</tr>
		<tr>
			<ti>GENTOO_MIRRORS</ti>
			<ti>Durch Leerzeichen getrennte Liste von URIs die im zur Zeit Gentoo Pakete spiegeln. Portage
			verucht zun&#xE4;chst von einem <c>GENTOO_MIRROR</c> herunter zu laden, bevor es die offizielle
			<c>SRC_URI</c> ausprobieren. Um das &#xDC;berspringen von Mirrors zu erzwingen, kann diese Variable auf ""
			gesetzt werden.</ti>
		</tr>
		</table>
		</body>
	</section>

	<section>
		<title>Was ist mit <path>/etc/make.defaults</path> passiert?</title>
		<body>
		<p>Seit Portage 1.5 und danach ist <path>/etc/make.defaults</path> veraltet;
		wenn Sie portage-1.5-r1 oder neuer installiert haben, k&#xF6;nnen Sie es ohne Probleme l&#xF6;schen.
		Die Datei wurde ersetzt durch <path>/etc/make.profile/make.defaults</path>
		(<path>/etc/make.profile</path> sollte aktuell ein Symbolischer-Link nach
		<path>/usr/portage/profiles/default</path> sein),
		welche System-Profil-Spezifische standard Einstellungen enth&#xE4;lt. Die Priorit&#xE4;tsreihenfolge der unterschiedlichen Konfigurations-Datei ist folgende (h&#xF6;ste zuerste):
		<ol>
			<li>Umgebungs-Variablen</li>
			<li><path>/etc/make.conf</path>, f&#xFC;r Ihre Verwednung</li>
			<li><path>/etc/make.profile/make.defaults</path>, f&#xFC;r Profil-Spezifische Standards</li>
			<li><path>/etc/make.globals</path>, f&#xFC;r globale Standards (Einstellungen die nicht speziell an irgend einer anderen Stelle gesetzt wurden, kommen von hier)</li>
		</ol></p></body>
	</section>

	<section>
		<title>Gibt es eine M&#xF6;glichkeit alle installierten Pakete zu aktualisieren wie z. B.
		<e>apt-get upgrade</e> oder <e>make World</e>?</title>
		<body><p><b>JA!</b> Geben Sie <c>emerge --update</c> ein (erst mit <c>--pretend</c>
		aufrufen), um die Kern-System-Pakete zu aktualisieren, und <c>emerge --update world</c>
		(wieder erst mit <c>--pretend</c> aufrufen), um ein komplettes System Upgrade aller
		installierten Pakete zu machen.
		</p></body>
	</section>

	<section>
		<title>Wenn ich ein Paket mit <c>emerge</c> oder <c>ebuild</c> aktualisiere, wie kann ich 
		verhindern, dass meine config Dateien sich anh&#xE4;ufen?</title>
		<body><p>
		Portage enth&#xE4;lt standardm&#xE4;ssig eine Unterst&#xFC;tzung f&#xFC;r config Dateien. <c>emerge --help config</c>
		gibt dar&#xFC;ber mehr Informationen. Eine einfacher Grund daf&#xFC;r ist, dass ein Paket namens <path>foo</path>
		irgendeine config Datei unter <path>/etc</path> ablegt und eine config Datei eines anderen <path>foo</path>
		Paketes bereits darin existiert, was zum &#xDC;berschreiben dieser Datei f&#xFC;hren w&#xFC;rde. Die neue config
		Datei von <path>foo</path> wird deshalb als <path>._cfgxxxx_foo</path> in diesem Verzeichnis abgespeichert.
		Ein sinnvolles Werkzeug zum Untersuchen und Aktualisieren von gesch&#xFC;tzten config Dateien ist <c>etc-update</c>,
		welches durch ein <c>emerge app-admin/gentoolkit</c> zu haben ist.
		</p></body>
	</section>

	<section>
		<title>Ich m&#xF6;chte den <c>./configure</c> Schritt selber ausf&#xFC;hren. Geht das?</title>
		<body><p>
		Ja, aber es ist nicht ganz einfach. Als erstes sollte <c>man ebuild</c> gefolgt von einem
		<c>ebuild foo-x.y.z.ebuild unpack</c> ausf&#xFC;hren. Mit <c>cd</c> in das <path>/var/tmp/portage/foo-x.y.z/work</path>
		Verzeichnis wechseln. Dort k&#xF6;nnen die Schritte f&#xFC;r <c>./configure</c> und <c>make</c>
		selbst eingegeben werden (mann muss beide ausf&#xFC;hren, da Portage nicht zwischen den Konfigurations
		und ebuild Schritten unterscheidet). Um mit Portage nun die restliche Installation durchzuf&#xFC;hren
		(es kann dann sp&#xE4;ter ganz einfach, wenn gew&#xFC;nscht, wieder entfernt werden) wird mit <c>touch /var/tmp/portage/foo-x.y.z/.compiled</c> Portage mitgeteilt, dass
		das ebuild von <c>ebuild foo-x.y.z.ebuild compile</c> schon abgeschlossen ist. Mit <c>ebuild foo-x.y.z.ebuild merge</c>
		wird dann das Paket noch in das Portage Verzeichnis aufgenommen (und wird dar&#xFC;ber hinaus als m&#xF6;gliche
		Abh&#xE4;ngigkeit eingetragen).
		</p></body>
	</section>

	<section>
		<title>Was, wenn rsync bei mir nicht funktioniert?</title>
		<body><p>
		Wenn der Rechner sich hinter einem Firewall befindet, der die rsync Verbindungen blockiert, kann 
		alternativ ein t&#xE4;glich aktualisierter Schnappschuss von /usr/portage unter <uri>http://gentoo.oregonstate.edu/snapshots/</uri>
		heruntergeladen werden. Dieses wird mit <c>tar xvjf portage-foo.tbz2</c> in das <path>/usr</path> Verzeichnis
		entpackt.
		</p></body>
	</section>

	<section>
		<title>Wie benutze ich <i>emerge</i> hinter einer Firewall?</title>
		<body><p>
		Ver&#xE4;ndern Sie die PROXY Einstellungen in <path>/etc/make.conf</path>. Wenn das nicht
		funktioniert, bearbeiten Sie <path>/etc/wget/wgetrc</path> und passen Sie http_proxy und
		ftp_proxy entspr&#xE4;chend an.
		</p></body>
	</section>

	<section>
		<title>Kann ich von einem anderen Betriebssystem aus ein rsync machen?</title>
		<body><p>Es gibt ein Programm das unison heisst, das sowohl unter UNIX als auch unter Win32 l&#xE4;uft. Es ist verf&#xFC;gbar unter:
		<uri>http://www.cis.upenn.edu/~bcpierce/unison/</uri>.</p></body>
	</section>

	<section>
		<title>Ich habe zu Hause nur eine langsame Modem-Verbindung. Kann ich die Quellen woanders herunterladen und dann zu meinem System hinzuf&#xFC;gen?</title>
		<body><p>
		Nat&#xFC;rlich. Mit dem Befehl <c>emerge --pretend package</c> kann man sehen, welche Pakete f&#xFC;r die
		Installation ben&#xF6;tigt werden. Die heruntergeladen Quelldateien k&#xF6;nnen nun &#xFC;ber ein Medium nach
		Hause genommen werden und werden in das <path>/usr/portage/distfiles</path> Verzeichnis kopiert.
		Anschliessend muss nur noch <c>emerge package</c> ausgef&#xFC;hrt werden, welches nun die mitgebrachten
		Quelldateien verwendet.
		</p></body>
	</section>

	<section>
		<title>Die ganzen .tar.gz Quelldateien sammeln sich in /usr/portage/distfiles/ an und verbrauchen
		wertvolle Plattenkapazit&#xE4;ten. K&#xF6;nnen diese Dateien gel&#xF6;scht werden?</title>
		<body><p>
		Ja, das ist ohne Probleme m&#xF6;glich. Aber wenn Sie eine langsame Internetverbindung besitzen, sollten
		die Archive m&#xF6;glichst behalten, da manchmal f&#xFC;r ein einziges St&#xFC;ck Software mehrere verschiedene
		Ebuilds existieren - bnach dem L&#xF6;schen des Archives muss das Paket neu aus dem Internet geladen werden.
		</p></body>
	</section>

	<section>
		<!--noch nicht &#xFC;bersetzt (JS)-->
		<title>Wie kann ich meine eigenen ebuilds verwalten, ohne dass sie durch ein (r)sync &#xFC;berschrieben werden?</title>
		<body>
		<p>Am einfachsten geht dies mit Anonymous CVS und mit dem Aufbewahren der loaklen ebuilds in /usr/portage/local.
		So wird es gemacht:</p>
		<pre>
		# <i>emerge cvs</i> <comment>(wenn nicht bereits erfolgt)</comment>
		# <i>cd <path>/usr</path></i>
		# <i>cvs -d :pserver:anonymous@gentoo.org:/home/anoncvs login</i> <comment>( &lt;Enter&gt; dr&#xFC;cken)</comment>
		# <i>cvs -d :pserver:anonymous@gentoo.org:/home/anoncvs get gentoo-x86</i>
		# <i>cp /usr/portage/distfiles/* gentoo-x86/distfiles/</i>
		# <i>cp -a /usr/portage/packages/* gentoo-x86/packages/</i>
		# <i>mv portage portage.old</i>
		# <i>ln -s gentoo-x86 portage</i>
		# <i>mkdir /usr/portage/local</i>
		# <i>echo local &gt;&gt; /usr/portage/profiles/categories</i>
		# <i>cp /etc/make.conf /etc/make.conf.orig</i>
		# <i>sed -e 's/#SYNC="cvs/SYNC="cvs/' /etc/make.conf.orig &gt; /etc/make.conf</i>
		</pre>
		</body>
	</section>
</chapter>

<chapter>
	<title>Gentoo Linux benutzen</title>
	<section>
    		<title>Ich habe openssh auf meiner Box installiert, aber ich kann mich nur als root und nicht als normaler Benutzer von aussen einloggen.</title>
    		<body>
		<p>
		Dies kann passieren wenn der Benutzer Account nicht ein richtiges shell eingestellt hat.
		&#xDC;berpr&#xFC;fen Sie den Benutzer Eintrag in
		<path>/etc/passwd</path> und sehen sie nach ob die Zeile mit /bin/bash (oder einem anderen Shell) endet. Wenn dies nicht der Fall ist,
		m&#xFC;ssen sie einen Shell f&#xFC;r den User einstellen. Dies ist mit dem usermod Befehl m&#xF6;glich, wie dieses ;
		</p>
		<pre># <i>usermod -s /bin/bash meinuser</i></pre>
		</body>
	</section>
	
	<section>
		<title>Ich kann X Anwendungen nur als root ausf&#xFC;hren.</title>
		<body><p>Ihr <path>/tmp</path> Verzeichnis hat die falschen Zugriffsrechte. Geben sie folgendes als root ein:</p>
		<pre># <i>chmod 1777 /tmp</i></pre>
		</body>
	</section>

	<section>
		<title>Wie stelle ich ein internationales Tastatur-Layout ein?</title>
		<body><p>Passen Sie die <c>KEYMAP</c> Variable in <path>/etc/rc.conf</path> an. Entweder
		booten Sie danach das System, oder starten Sie das Keymaps-Script neu:
		<c>/etc/init.d/keymaps restart</c>.</p>
		</body>
	</section>

	<section>
		<title>Die DNS Namens Aufl&#xF6;sung funktioniert nur f&#xFC;r root.</title>
		<body><p><path>/etc/resolv.conf</path> hat die falschen Zugriffsrechte. <c>chmod</c> es zu folgendem:
		</p>
		<pre># <i>chmod 0644 /etc/resolv.conf</i></pre>
		</body>
	</section>

	<section>
		<title>Warum liesst KDE nicht <path>/etc/profile</path>?</title>
		<body><p>Man muss <c>--login</c> in der ersten Zeile in <path>/opt/kde2.1/bin/startkde
		</path> hinzuf&#xFC;gen, damit es so aussieht:</p>
		<pre>#!/bin/sh --login</pre>
		<p>Diese &#xC4;nderung wurde in neueren KDE Versionen bereits vorgenommen.</p>
		</body>
	</section>
</chapter>

<chapter>
	<title>Verwaltung</title>
	<section>
		<title>Probleme mit einem besch&#xE4;digten Dateisystem unter ReiserFS -- wie behebe ich das?</title>
		<body>
		<p>
		ReiserFS hat grosse Probleme in Verbindung mit den 2.4 Kernel Reihen. Wir raten zur Zeit nachdr&#xFC;cklich
		von der Verwendung mit ReiserFS ab. Wenn die ReiserFS Partition bereits besch&#xE4;digt ist, sollten Sie
		mit der Gentoo Linux CD booten und <c>reiserfsck --rebuild-tree</c> auf das besch&#xE4;digte Dateisystem
		ausf&#xFC;hren. Dies sollte die Konsistenz des Dateisystems wieder herstellen, auch wenn einige Dateien
		oder Verzeichnisse durch die Besch&#xE4;digung verloren gegangen sein k&#xF6;nnen.
		</p>
		</body>
	</section>
<!-- Wenn's nich wichtig is, warum is das drin?
     Also Raus Damit (MK)
     Stimme Dir zu (JS)
     is this still relevant? -cpm
	<section>
		<title>How to I view the timestamps in /var/log/syslog.d, etc. on a pre-1.0_rc5 Gentoo 
		system?</title>
		<body>
		<p>To view multilog (Gentoo Linux 1.0_rc5 and earlier) timestamps, you need to pipe the 
		current log through the <c>tai64nlocal</c>command:</p>

<pre>
# <i>cat /var/log/syslog.d/current | tai64nlocal | less</i>
</pre>

<p>Or, alternatively, if you want to "tail" the log:</p>

<pre>
# <i>tail -f /var/log/syslog.d/current | tai64nlocal</i>
</pre>

</body>
	</section>
-->
</chapter>

<chapter>
	<title>Entwicklung</title>
	<section>
		<title>Wie kann ich Fehler melden?</title>
		<body><p>F&#xFC;r Bugs in einem speziellen Programm, kontaktieren sie den jeweiligen Programm Ersteller.
		Alternativ k&#xF6;nnen Sie unsere Bugzilla Fehlermeldung unter <uri>http://bugs.gentoo.org</uri> verwenden.
		Auch sind wir in im <uri link="http://www.openprojects.net">OpenProjects</uri> IRC Netzwerk unter 
		<c>#gentoo</c> zu erreichen.
		</p></body>
	</section>

	<section>
		<title>Wie oft gibt es Neuerscheinungen?</title>
		<body><p>Neuerscheinungen werden in der <uri link="http://lists.gentoo.org/mailman/listinfo/gentoo-announce">gentoo-announce</uri>
		Mailliste angek&#xFC;ndigt.<!-- TODO: approximatley every X months --> Im Normalfall werden die Pakete aktualisiert,
		wenn von den Autoren neuer Quellcode bereitgestellt wird. Neue CD Images werden in der Regel nur dann erstellt,
		wenn grosse Ver&#xE4;nderungen am Basissystem vorgenommen wurden, oder neue Module hinzugef&#xFC;gt werden.
		</p></body>
	</section>

	<section>
		<title>Ich m&#xF6;chte ein neues Paket in Portage einbringen? Wie gehe ich vor?</title>
		<body><p>Unter <uri>http://bugs.gentoo.org</uri> sollte einfach ein Bug von der Sorte
		"ebuild" erstellt werden.  Das ebuild sollte dann an diese Meldung angeh&#xE4;ngt werden.</p></body>
	</section>

	<section>
		<title>Wie kann ich eine neue Frage zu diesem FAQ hinzuf&#xFC;gen?</title>
		<body><p>Ebenfalls unter <uri>http://bugs.gentoo.org</uri> einen neuen Bugreport erstellen und
		in der Kategorie "Docs-user" einreichen. Dies gilt allerdings nur f&#xFC;r die englischen Originaldokumente.
		F&#xFC;r die deutschen &#xFC;bersetzungen gen&#xFC;gt eine Mail an gentoo-deutsch-dev@lists.berlios.de
		</p></body>
	</section>

	<section>
		<title>make -f Makefile.cvs f&#xFC;r eine KDE Anwendung ergibt folgende Fehlermeldung: "invalid unused variable"</title>
		<body><p>
		F&#xFC;r alle KDE Projekte sollte vorher <c>WANT_AUTOMAKE_1_4=1</c> exportiert werden, bevor der Befehl
		<c>make -f Makefile.cvs</c>ausgef&#xFC;hrt wird. F&#xFC;r KDE2 Anwendungen gilt analog: <c>WANT_AUTOCONF_2_1=1</c>,
		und f&#xFC;r KDE3: <c>WANT_AUTOCONF_2_5=1</c>.
		</p></body>
	</section>


	<section>
   		<title>Mein eingebauter Lautsprecher piept wie verr&#xFC;ckt w&#xE4;hrend der kompilierung von Mozilla. Wie kann ich Piepst&#xF6;ne
		in der Konsole ausschalten?
    		</title>
 		<body><p>
		Piepst&#xF6;ne in der Konsole k&#xF6;nnen mit setterm ge&#xE4;ndert werden:
		<pre># <i>setterm -blength 0</i></pre>
		Sollen dies bei jedem Start ausgef&#xFC;hrt  werden, so muss dieser Befehl in <path>/etc/conf.d/local.start</path>
		eingef&#xFC;gt werden. Dies deaktiviert allerdings nur das aktuelle Terminal. Wenn alle Terminals stumm geschaltet
		werden sollen, sollte der Befehl auch auf die anderen Terminals geleitet werden:
		<pre># <i>setterm -blength 0 >/dev/vc/1</i></pre>
		F&#xFC;r /dev/vc/1 muss das gew&#xFC;nschte Terminal eingetragen werden.
        	</p></body>
	</section>
</chapter>

<chapter>
<title>Resources</title>
	<section>
		<title>Wo kann ich mehr &#xFC;ber supervise das bei Gentoo Linux 1.0_rc5 und fr&#xFC;her benutzt wurde finden?</title>
		<body><p><!-- TODO: --><uri>http://cr.yp.to/daemontools.html</uri></p></body>
	</section>

	<section>
		<title>Wo kann man mehr Informationen &#xFC;ber Gentoo Linux finden?</title>
		<body><p>Die Offizelle Gentoo Dokumentation kann bei <uri>http://www.gentoo.org</uri> gefunden werden. 
		Homepage vom &#xDC;bersetzungsprojekt ins Deutsche <uri>http://gentoo-deutsch.berlios.de</uri>. 
		Standard Linux Information sind unter <uri>http://www.linuxdoc.org</uri> verf&#xFC;gbar.
		</p></body>
	</section>

	<section>
		<title>Kann man CDs von Gentoo Linux kaufen?</title>
		<body><p>USA: Ja! Frische CDRs sind f&#xFC;r $5 USD von <uri>http://www.cheapbytes.com</uri> kaufbar.
		</p>
		<p>Europa/Deutschland: Gentoo Linux 1.2 CD's k&#xF6;nnen f&#xFC;r 5 Euro bei <uri>http://www.lin24.de</uri> und <uri>http://www.liniso.de</uri> bezogen werden.
		</p></body>
	</section>
	<section>
		<title>Diese FAQ konnte meine Fragen nicht beantworten. Was mache ich jetzt?</title>
		<body><p>Als erster Schritt sollten die Dokumente unter <uri>http://www.gentoo.org/index-docs.html</uri> (in Deutsch:  <uri>http://www.gentoo.de</uri> )
		durchforstet werden. Findet sich darin keine L&#xF6;sung, kann man sich in die verschiedenen Maillisten unter <uri>www.gentoo.org</uri> eintragen. Um
		die Archive der Maillisten zu durchsuchen, ist Google (<uri>www.google.com</uri>) sehr praktisch. Einfach "lists.gentoo.org foo"
		als Suchanfrage stellen. Alternativ kann auch ein Blick in das Forum (<uri>http://forums.gentoo.org/</uri>) helfen. Oder Sie stellen ihre
		Frage im IRC unter <c>#gentoo</c> bzw. <c>#gentoo.de</c> von <uri>irc.openprojects.net</uri>.
		</p></body>
	</section>
</chapter>
</guide>
