<?xml version='1.0'?>
<!DOCTYPE guide SYSTEM "/dtd/guide.dtd">
<guide link="/doc/de/java.xml">

<title>Gentoo Java Anleitung</title>

<author title="Gentoo Doc Editor"><mail link="karltk@gentoo.org">Karl Trygve Kalleberg</mail></author>
<author title="&#220;bersetzung"><mail link="kontakt@hendrik-brandt.de">Hendrik Brandt</mail></author>

<abstract>
Anleitung f&#252;r Benutzer und Entwickler von Java unter Gentoo Linux
</abstract>

<version>1.0</version>
<date>25. Juni 2002</date>

<chapter>
<title>Installation eines JDK/JRE</title>
<section>
<title>&#220;berblick</title>
<body>
<p>Gentoo Linux unterst&#252;zt verschiedene JDKs und JREs. Als Standard ist das Blackdown JDK/JRE installiert, da es frei verf&#252;gbar ist und sie keinem Registrierungszwang unterliegen.</p>
<note>As kaffe becomes a JRE/JDK drop-in replacement, that will most likely become our default.</note>

<p>Allgemein sind die JDKs/JREs von Sun oder IBM schneller, allerdings bedeutet es etwas mehr Arbeit an sie heran zukommen, da es notwendig ist, vor dem Herunterladen die Lizenzbestimmungen zu lesen und zu akzeptieren. IBM verlangt desweiteren eine Registrierung des Nutzers.</p>
<p>Die ebuilds f&#252;r die Sun und IBM JDKs/JREs werden sie darauf hinweisen, von wo sie die entsprechenden Pakete herunterladen k&#246;nnen.</p>
</body>
</section>
<section>
<title>Installation des Sun/IBM JDKs/JREs</title>
<body>
<p>Wenn sie <c>emerge dev-java/sun-jdk-1.3.1</c> oder <c>emerge dev-java/ibm-jdk-1.3.1</c> ausf&#252;hren, werden sie darauf hingewiesen, dass sie die entsprechenden TAR-Archive selbst herunterladen m&#252;ssen. Dies ist auf Grund der Lizenzbestimmungen von Sun bzw. des Registrierungszwangs beim IBM JDK/JRE notwendig.</p>
<note>Es gibt auch ein dev-java/sun-jdk-1.4.0 ebuild, allerdings laufen nicht alle Programme fehlerfrei mit Java 1.4. Somit liegt es an ihnen, ob sie Java 1.4 verwenden wollen.</note>
<p>
Sie m&#252;ssen die notwendigen Dateien in das Verzeichnis <path>/usr/portage/distfiles</path> herunterladen. Sobald dies getan ist, m&#252;ssen sie erneut emerge ausf&#252;hren und somit wird das JDK/JRE nach <path>/opt</path> installiert.
</p>
</body>
</section>
</chapter>

<chapter>
<title>Konfiguration des JDK/JRE</title>
<section>
<title>&#220;berblick</title>
<body>
<p>Gentoo Linux bietet die M&#246;glichkeit verschiedene JDKs und JREs parallel installiert zu haben, ohne das diese in Konflikt miteinander kommen. Es gibt einige Besonderheiten, die weiter unten erl&#228;utert werden.</p>
<p>Mit Hilfe von <c>java-config</c> k&#246;nnen sie als root die systemweiten Java-Vorgaben festlegen. Au&#223;erdem hat jeder Nutzer die M&#246;glichkeit durch <c>java-config</c> seine eigenen Vorgaben einzustellen, wenn diese sich von den systemweiten unterscheiden.</p>
</body>
</section>
<title></title>
<section>
<title>Ein Standard-JDK/JRE festlegen</title>
<body>
<p>Durch das Kommando <c>java-config --list-available-vms</c> wird eine Liste der auf ihrem System verf&#252;gbaren JDKs/JREs ausgegeben:</p>
<pre>
[%1 ~] java-config --list-available-vms
[blackdown-jdk-1.3.1] Blackdown JDK 1.3.1 (/etc/env.d/java/20blackdown-jdk-1.3.1)
[blackdown-jre-1.3.1] Blackdown JRE 1.3.1 (/etc/env.d/java/20blackdown-jre-1.3.1)
[ibm-jdk-1.3.0] IBM JDK 1.3.0 (/etc/env.d/java/20ibm-jdk-1.3.0)
[ibm-jdk-1.3.1] IBM JDK 1.3.1 (/etc/env.d/java/20ibm-jdk-1.3.1)
[ibm-jre-1.3.1] IBM JRE 1.3.1 (/etc/env.d/java/20ibm-jre-1.3.1)
[sun-jdk-1.4.0] Sun JDK 1.4.0 (/etc/env.d/java/20sun-jdk-1.4.0)
</pre>
<p>Der Text in eckigen Klammern "[]" ist der Name oder die ID f&#252;r die jeweilige VM (Virtual Machine). Sie m&#252;ssen diese ID mit <c>java-config --set-system-vm</c> wie folgt verwenden:</p>
<pre>
[#1 ~] java-config --set-system-vm=ibm-jdk-1.3.1
Now using IBM JDK 1.3.1 (/etc/env.d/java/20ibm-jdk-1.3.1)
</pre>
<note>Sie m&#252;ssen root sein, um --set-system-vm auszuf&#252;hren</note>
<p>Sobald sie <c>java-config --set-system-vm</c> mit einer entsprechenden VM ID ausgef&#252;hrt haben, m&#252;ssen sie ihre <path>/etc/profile.env</path> aktualisieren:</p>
<pre>
[#1 ~] env-update
</pre>
<p>Anschlie&#223;end m&#252;ssen sie sich neu am System anmelden oder ihre <path>/etc/profile</path> erneut in die Umgebung einbinden (<c>source /etc/profile</c>).</p>
<p>Als normaler Nutzer k&#246;nnen sie <c>java-config --set-user-vm</c> anwenden, um ein eignes JDK/JRE festzulegen. Dabei wird die Datei <path>$HOME/.gentoo/java-env</path> mit allen notwendigen Umgebungsvariablen angelegt. F&#252;r gew&#246;hnlich wird dies in den Start-Skript der Shell eingebunden (z.B. <path>$HOME/.zshenv</path>)</p>
</body>
</section>
<section>
<title>Einen Standard CLASSPATH setzen</title>
<body>
<p><c>java-config</c> kann (und sollte) desweiteren dazu verwendet werden, sowohl einen systemweiten Standard CLASSPATH (Klassenpfad), als auch einen Nutzerspezifischen CLASSPATH zu setzen.</p>
<p>Zun&#228;chst sollte man sich eine Liste mit allen verf&#252;gbaren Bibliotheken ausgeben lassen:</p>
<pre>
[%1 ~] java-config --list-available-packages
[ant] No description (/usr/share/ant/classpath.env)
[java-gnome] No description (/usr/share/java-gnome/classpath.env)
[java-gtk] No description (/usr/share/java-gtk/classpath.env)
[log4j] "" (/usr/share/log4j/package.env)
</pre>
<note>Derzeit hat keines der Pakete eine passende Beschreibung, dies wird jedoch in naher Zukunft implementiert.</note>
<p>Nochmal sei darauf hingewiesen, dass der Text in eckigen Klammern "[]", die IDs sind, die an <c>java-config --set-system-classpath</c> &#252;bergeben werden m&#252;ssen:</p>
<pre>
java-config --set-system-classpath=log4j,java-gtk,java-gnome
</pre>
<note>Das aktuelle Verzeichnis (.) wird kein Teil des Systemweiten Klassenpfades sein. Es sollte in das Login-Profil von root eingetragen werden.</note>
<p>Erneut m&#252;ssen sie <c>env-update</c> ausf&#252;hren, um die Systemumgebung zu aktualisieren. Au&#223;erdem m&#252;ssen sie sich neu anmelden oder <path>/etc/profile</path> neu einbinden (<c>source /etc/profile</c>).</p>
<p>F&#252;r normale Nutzer erzeugt <c>java-config --set-user-classpath</c> die Datei <path>$HOME/.gentoo/java-env-classpath</path>, welche automatisch von <path>$HOME/.gentoo/java-env</path> eingebunden wird</p>
</body>
</section>
</chapter>

<chapter>
<title>Weiterf&#252;hrende Quellen</title>
<section>
<title>Offline Quellen</title>
<body>
<ul>
<li>java-config man page</li>
<li><c>java-config --help</c></li>
<li>Das <path>/usr/bin/java-config</path> Skript selbst</li>
</ul>
</body>
</section>
<section>
<title>Online Quellen</title>
<body>
<ul>
<li>Die Archive der <uri link="http://lists.gentoo.org/pipermail/gentoo-dev/">gentoo-dev</uri> und <uri link="http://lists.gentoo.org/pipermail/gentoo-user/">gentoo-user</uri> Mailing-Listen</li>
<li>#gentoo unter irc.openprojects.net</li>
</ul>
</body>
</section>
</chapter>

<chapter>
<title>Besonderheiten</title>
<section>
<title>Allgemein</title>
<body>
<p>Wenn sie eine JRE als ihren vorgegeben Java-Interpreter (Java-VM) eingestellt haben, steht ihnen der Java-Compiler <c>javac</c> nicht zur Verf&#252;gung, es sei denn sie setzen selbst einen Link auf die Datei javac.</p>
<p>Sobald es verf&#252;gbar ist wird Jikes verwendet, um einge der gr&#246;&#223;eren Pakete zu &#252;bersetzen. Mit der Zeit wird es hoffentlich m&#246;glich werden alle Java-abh&#228;ngigen Pakete mit Jikes zu &#252;bersetzen, so dass einige Abh&#228;ngigkeiten vom JDK zu Abh&#228;ngigkeiten vom JRE &#252;berf&#252;hrt werden k&#246;nnen.</p>
<p>Bei einigen Versionen von Portage f&#252;hrt ein <c>emerge --world update</c> dazu, dass ein JDK installiert wird, ohne R&#252;cksicht darauf, ob sie es bereits vorher installiert hatten oder nicht. Dies ist ein bekannter Fehler in Portage und wird in einer zuk&#252;nftigen Version behoben.</p>
</body>
</section>
</chapter>
</guide>
