<?xml version='1.0'?>
<?xml-stylesheet href="/xsl/guide.xsl" type="text/xsl"?>

<!DOCTYPE guide SYSTEM "/dtd/guide.dtd">

<guide link="/doc/de/portage-user.xml">
<title>Portage Benutzer Leitfaden</title>
<author title="Chief Architect"><mail link="drobbins@gentoo.org">Daniel Robbins</mail></author>
<author title="Editor"><mail link="thomasfl@gentoo.org">Thomas Flavel</mail></author>
<author title="&#220;bersetzung"><mail link="sebastian@beneke-it.de">Sebastian Beneke</mail></author>

<abstract>Diese Anleitung soll einen kurzen &#220;berblick geben, wie Sie Ihre Pakete aktuell halten und
das System pflegen k&#246;nnen.</abstract>

<version>1.2.1</version>
<date>04 Jun 2002</date>

<chapter>
<title>Zu Beginn</title>

<section>
<title>Downloaden des Portage tree</title>
<body>

<p>Nachdem Sie Gentoo Linux installiert und ein wenig mit ihm gearbeitet haben, ist es m&#246;glich, da&#223; Sie Fehler 
in einigen Paketen entdecken oder Sie wollen einfach nur die neusten Gentoo Linux Software Pakete installieren bzw.
Ihre momentanen Pakete updaten. Um dies durchf&#252;hren zu k&#246;nnen m&#252;ssen Sie unseren neuesten Portage Ports Tree
downloaden. Hier beschreiben wir wie es geht.</p>

<p>Zun&#228;chst erstellen Sie ein Verzeichnis namens <path>/usr/portage</path>. Danach stellen Sie sicher, das rsync installiert ist. Sollte
dies nicht der Fall sein, downloaden Sie es von unserem ibiblio Mirror und installieren Sie es mit <c>emerge
rsync-x.y.z.tbz2</c>. Danach synchronisieren Sie Ihr Portage Verzeichnis mittels:
</p>
<pre>
# <i>emerge rsync</i>
</pre>

<p>Sie sollten regelm&#228;&#223;ig folgenden Befehl ausf&#252;hren um alte ebuild Scripte zu entfernen</p>

<warn>Bitte beachten Sie, dass <c>emerge --clean rsync </c> alle Ihre pers&#246;nlichen Ver&#228;nderungen und Erg&#228;nzungen im 
<path>/usr/portage </path>tree l&#246;scht. Bitte verwenden Sie diesen Befehl mit Vorsicht.</warn>

<pre>
# <i>emerge --clean rsync </i>
</pre>

<p>Wenn Sie regelm&#228;&#223;ige Ver&#228;nderungen an Ihrem <path>/usr/portage</path> tree vornehmen,
k&#246;nnen Sie <mail link="drobbins@gentoo.org">Daniel</mail> f&#252;r einen Zugang zum CVS
kontaktieren. Damit k&#246;nnen Sie einige oder alle Ihre Ver&#228;nderungen zu unserem offiziellen CVS tree hinzuf&#252;gen.
</p>

</body>
</section>

<section>
<title>Portage updaten</title>
<body>
<p>Bevor Sie unseren Portage tree verwenden k&#246;nnen, ist es wichtig dass Sie Ihr Portage updaten. Um 
dies zu tun geben Sie folgendes ein:
</p>

<pre>
# <i>cd /usr/portage/sys-apps/portage</i>
# <i>emerge portage-x.y.z.ebuild</i>
</pre>

<p>Nun benutzen Sie die neueste Version von Portage. Ab jetzt k&#246;nnen Sie unser ebuild System benutzen 
um Ihre installierte Software auf den neuesten Stand zu bringen</p>

</body>
</section>
</chapter>
<chapter>
<title>Einf&#252;hrung von <c>emerge</c></title>
<section>
<title><c>emerge --pretend</c></title>
<body><p> 
Um ein Paket zu installieren gehen Sie in sein Verzeichnis unterhalb von <path>/usr/portage</path>, z.B.:
</p>

<pre>
# <i>cd /usr/portage/net-irc/xchat</i> 
</pre>

<p>Dann f&#252;hren Sie <c>emerge --pretend</c> aus, um zu sehen welche Abh&#228;ngigkeiten (falls es welche gibt) 
installiert werden</p>

<pre>
# <i>emerge --pretend xchat-1.4.3.ebuild</i>

These are the packages that I would merge, in order.

Calculating dependencies......... done!
[ebuild   U] sys-libs/zlib-1.1.3-r2 to /
[ebuild   U] dev-libs/glib-1.2.10 to /
[ebuild N  ] media-libs/jpeg-6b-r2 to /
[ebuild N  ] x11-base/xfree-4.0.3-r3 to /
[ebuild N  ] x11-libs/gtk+-1.2.10-r1 to /
[ebuild N  ] media-libs/giflib-4.1.0-r3 to /
[ebuild N  ] media-libs/tiff-3.5.6_beta to /
[ebuild N  ] media-libs/imlib-1.9.10 to /
[ebuild N  ] net-irc/xchat-1.4.3 to /
</pre>

<p>In diesem bestimmten Fall werden wir <path>xchat</path> auf einer
Maschine ohne X installieren.  So hat <c>emerge --pretend</c>
richtig festgestellt, da&#223; zun&#228;chst etliche Abh&#228;ngigkeiten erf&#252;llt werden m&#252;ssen. 
Besonders <path>sys-libs/zlib</path> und <path>dev-libs/glib</path> m&#252;ssen aktualisiert 
werden (U) und dann m&#252;ssen noch einige ebuilds (nat&#252;rlich inklusive <path>x11-base/xfree</path>) eingespielt werden (N).</p>
</body>
</section>
<section>
<title>USE und <c>emerge</c></title>
<body>
<p>Oben habe ich <c>emerge --pretend</c> auf einem System ausgef&#252;hrt, welches
<c>gnome</c> nicht in der <c>USE</c> Variable in <path>/etc/make.conf</path> definiert hat.
Das bedeutet, dass optionale GNOME Unterst&#252;tzung, falls vorhanden, nicht aktiviert wird. 
Wie auch immer, <path>xchat</path> <e>hat</e> optionale GNOME Unterst&#252;tzung. Nun lassen 
Sie uns einen Blick auf die Ausgabe von <c>emerge --pretend</c> werfen nachdem ich <c>gnome</c> zur
<c>USE</c> Umgebungsvariable in <path>/etc/make.conf</path> erg&#228;nzt habe:
</p>

<pre>
# <i>emerge --pretend xchat-1.4.3.ebuild</i>

These are the packages that I would merge, in order.

Calculating dependencies............................ done!
[ebuild N  ] media-libs/jpeg-6b-r2 to /
[ebuild N  ] gnome-base/libghttp-1.0.9 to /
[ebuild N  ] media-libs/audiofile-0.2.1 to /
[ebuild N  ] media-sound/esound-0.2.22-r2 to /
[ebuild N  ] gnome-base/gnome-env-1.0 to /
[ebuild N  ] gnome-base/libxml-1.8.11 to /
[ebuild N  ] gnome-base/ORBit-0.5.8 to /
[ebuild N  ] gnome-base/oaf-0.6.5 to /
[ebuild   U] dev-libs/glib-1.2.10 to /
[ebuild N  ] net-libs/libwww-5.3.2-r1 to /
[ebuild N  ] media-libs/giflib-4.1.0-r3 to /
[ebuild N  ] dev-util/guile-1.4-r3 to /
[ebuild   U] sys-libs/zlib-1.1.3-r2 to /
[ebuild N  ] x11-base/xfree-4.0.3-r3 to /
[ebuild N  ] x11-libs/gtk+-1.2.10-r1 to /
[ebuild N  ] media-libs/tiff-3.5.6_beta to /
[ebuild N  ] media-libs/imlib-1.9.10 to /
[ebuild N  ] gnome-base/gnome-libs-1.2.13 to /
[ebuild N  ] gnome-base/glibwww-0.2-r1 to /
[ebuild N  ] gnome-base/gdk-pixbuf-0.11.0 to /
[ebuild N  ] gnome-base/gconf-1.0.0 to /
[ebuild N  ] gnome-base/gnome-vfs-1.0.1 to /
[ebuild N  ] gnome-base/control-center-1.4.0.1 to /
[ebuild N  ] gnome-base/scrollkeeper-0.2 to /
[ebuild N  ] dev-util/xml-i18n-tools-0.8.1 to /
[ebuild N  ] gnome-base/libglade-0.16-r1 to /
[ebuild N  ] gnome-base/gnome-core-1.4.0.4 to /
[ebuild N  ] net-irc/xchat-1.4.3 to /
</pre>

<p>Wie Sie sehen erkennt emerge dank der gesetzten USE Variable, dass xchat optionale 
GNOME Unterst&#252;tzung beinhalten sollte. Damit diese optionale GNOME Unterst&#252;tzung 
korrekt compiliert werden kann, muss nat&#252;rlich GNOME zuerst installiert werden. 
<c>emerge</c> erkennt dies alles und erg&#228;nzt verschiedene Pakete, die zur GNOME Installation
ben&#246;tig werden zur Liste der zu installierenden ebuilds. In einigen F&#228;llen 
kann es vorkommen, dass Ihre USE Variable nicht richtig gesetzt ist. Dadurch kann es 
passieren, dass <c>emerge</c> unerwartete optionale Erweiterungen aktiviert oder ausschliesst. 
Deshalb empfehle ich, dass Sie vor dem eigentlichen <c>emerge</c> immer ein <c>emerge --pretend</c> 
ausf&#252;hren. Dies gilt besonders f&#252;r neue oder ungew&#246;hnliche ebuilds. Dadurch wissen Sie, was Sie erwartet. :) 
Sobald alles OK aussieht k&#246;nnen Sie mit dem eigentlich <c>emerge</c> durch weglassen der 
<c>--pretend</c> Option fortfahren:</p>

<pre>
# <i>emerge xchat-1.4.3.ebuild</i>
</pre>

<p>Nachdem alle Abh&#228;ngigkeiten installiert sind (soweit es welche gibt; 
nicht alle Pakete haben welche) wird der xchat Source nach <path>/usr/portage/distfiles</path> 
runtergeladen, verifiziert (md5), entpackt, compiliert und in ein tempor&#228;res 
Verzeichnis installiert. Danach werden sie ins lokale Filesystem integriert 
und eine Paketdatenbank in <path>/var/db/pkg/net-irc/xchat-1.4.3/CONTENTS</path> erstellt. 
Diese Datenbank enth&#228;lt die installierten Dateien und ihre md5-Checksummen.</p>

</body>
</section>
</chapter>
<chapter>
<title>Pakete upgraden</title>
<section>
<body>

<p>Der Standardweg um Pakete unter Gentoo Linux zu aktualisieren besteht darin, zun&#228;chst 
die neuen Pakete zu installieren und danach die alten Pakete zu deinstallieren. Dies ist 
sicher (und macht auch Spass) durchf&#252;hrbar. Zun&#228;chst installieren Sie das neue Paket 
wie oben beschrieben. Danach deinstallieren Sie das alte Paket mittels:</p>

<pre>
# <i>emerge unmerge =net-irc/xchat-1.0.0-r1</i>
</pre>

<p>
Portage benutzt ein sogenanntes "sicheres" deinstallieren; es "l&#246;scht" nur original 
Dateien. Wenn eine Datei &#252;berschrieben oder modifiziert wurde, bleibt es im 
Dateisystem erhalten (vorrausgesetzt, dass Sie eine neuere Version installiert 
haben). Wenn Sie also eine alte Version von xchat nach der Installation einer neuen 
Version l&#246;schen (unmergen), wird die ausf&#252;hrbare Datei von xchat nicht gel&#246;scht, solange 
sie einen neueren Zeitstempel bzw. eine andere md5-Checksumme hat. Dieses sichere 
L&#246;schen ist wirklich Gro&#223;artig, da es sicherstellt, dass jeder Zeit eine Version der 
Anwendung verf&#252;gbar ist. Sollten Sie zuerst gel&#246;scht haben w&#252;rde xchat f&#252;r einige Minuten 
nicht verf&#252;gbar sein bis die neue Version runtergeladen, compiliert und installiert w&#228;re.</p>

<impo> Portage hat nun eine spezielle Funktion, die "config file protection", 
eine Schutzfunktion f&#252;r Konfigurationsdateien. Die Aufgabe dieser Funktion ist es 
zu verhindern, dass neue Pakete bereits existierende Konfiguration ver&#228;ndern. 
Schutz der Konfigurationsdateien ist automatisch f&#252;r /etc und die KDE Konfigurationsverzeichnisse 
aktiviert. Um weiter Informationen dazu zu erhalten geben sie <c>emerge --help config</c> ein.</impo>

</body>
</section>
</chapter>
</guide>





