<?xml version='1.0'?>
<!DOCTYPE guide SYSTEM "/dtd/guide.dtd">
<guide link="/doc/de/use-howto.xml">
<title>Gentoo Anleitung zu den USE Flags</title>
<author title="Author"><mail link="seemant@gentoo.org">
	Seemant Kulleen</mail>
</author>
<author title="Editor"><mail link="meekrob@gentoo.org">
	Sherman Boyd</mail>
</author>
<author title="&#220;bersetzung"><mail link="sebastian@beneke-it.de">
        Sebastian Beneke</mail>
</author>

<abstract>Diese Anleitung stellt Ihnen das ultimative Werkzeug zur Anpassung 
der USE flags. Neben der reinen Aufz&#228;hlung aller verf&#252;gbaren Flags 
erfahren Sie hier welche USE Flags Sie brauchen.</abstract>

<version>1.0</version>
<date>16 Aug 2002</date>

<chapter>
<title>Einf&#252;hrung</title>
<section>
<title>Was ist &#252;berhaupt der Sinn von <c>USE</c> flags?</title>
<body>
<p>Das was mich am meisten als User zu Gentoo hingezogen hat war die 
Tatsachen, dass es eine stark anpassbare Distribution ist. Da Gentoo eine 
sourcenbasierte Distribution darstellt, hat der Benutzer die absolute Kontrolle 
&#252;ber alle Funktionen und Unterst&#252;zungen, die in die installierten Anwendungen 
einflie&#223;en. Dar&#252;ber hinaus mag ich es nicht Dinge installieren zu m&#252;ssen, die 
ich <e>wirklich</e> nicht brauche.</p>

<p>Und nun, wie genau setzt Gentoo dies um? Durch das Definieren von <c>USE</c> 
flags. Grunds&#228;tzlich sind dies Schl&#252;sselw&#246;rter, die Optionen definieren welche 
systemweit zur Konfiguration der Anwendungen w&#228;hrend des Compilations Prozesses genutzt 
werden.</p>

</body>
</section>

<section>
<title>Standard <c>USE</c> Flags</title>
<body>
<p>Nat&#252;rlich definiert Gentoo f&#252;r Sie bereits standardm&#228;&#223;ig einige sichere 
Flags. Diese finden Sie in Ihrer <path>/etc/make.profile/make.defaults</path> 
Datei.</p>


<p>Bei Gentoo-1.2 sind diese <c>USE</c> Flags wie folgt definiert:</p>

<pre>USE="3dnow apm arts avi berkdb crypt cups encode gdbm gif gpm gtk imlib ipv6 
java jpeg kde libg++ libwww mikmod mmx motif mpeg ncurses nls oggvorbis opengl pam 
pdflib png python qt qtmt quicktime readline sdl slang spell ssl svga tcpd truetype 
X xml2 xmms xv"</pre>


<warn>Anstatt diese Datei zu bearbeiten, wie es leider einige machen, sollten Sie auf 
jeden Fall die Datei <path>/etc/make.conf</path> bearbeiten.

In dieser Datei finden Sie:</warn>

	<pre>#USE=""</pre>
<p>Entfernen Sie einfach das Kommentarzeichen # und erg&#228;nzen Sie Ihre eigenen USE Flags 
zwischen den Anf&#252;hrungszeichen.</p>

<impo>Beachten Sie, dass <c>-flag</c> ein Flag deaktiviert und <c>flag</c> 
das entsprechende Flag aktiviert. Wenn ein Flag nicht in <path>/etc/make.profile/make.defaults</path> 
noch in <path>/etc/make.conf</path> zu finden ist, ist diese Funktion deaktiviert</impo>

<p>Einfach das Kommentierungszeiche # entfernen. Dann die gew&#252;nschten Flags 
erg&#228;nzen. "Aber was ist wenn ich nun ein Flag aus der make.defaults Datei 
entfernen m&#246;chte?" Dies l&#228;sst sich ganz einfach durch ein Erg&#228;nzen von "-flag" 
in <path>/etc/make.conf</path> erreichen. Meine <path> make.conf</path> sieht z.B. so 
aus:</p>

<pre>USE="-gnome -kde qt -arts -nls python perl oggvorbis opengl sdl
     -postgres jpeg png truetype xml xml2 dvd avi aalib mpeg encode fbcon
     mmx"</pre>

<p>Da Sie nun wissen wie man extra Flags aktiviert und existierende 
Flags deaktiviert, schauen wir uns mal an was diese Flags 
&#252;berhaupt machen.</p>
</body>
</section>
</chapter>

<chapter>
<title>Vorhandene <c>USE</c> Flags</title>

<section>
<title>HARDWARE FLAGS</title>
<body>
<p>F&#252;r Ihren Prozessor gibt es drei Flags: <c>mmx</c>, <c>3dnow</c>, und
<c>sse</c>.
<c>3dnow</c> ist anwendbar auf bestimmte AMD K-6, Athlon und h&#246;here CPUs.
<c>mmx</c> is anwendbar auf Pentium-MMX und h&#246;here CPUs inklusive Athlons.
<c>sse</c> ist eine Funktion f&#252;r h&#246;here Pentiums. Wenn Sie einen Pentium4 mit SSE2 haben, 
k&#246;nnen Sie ebenfalls dieses Flag nutzen.</p>

<p>Nun f&#252;r Ihre Grafikkarte. 
Wenn Sie eine 3dfx Karte haben, aktivieren Sie das <c>3dfx</c> Flag. Sollten Sie 
eine Voodoo3 Karte besitzen, k&#246;nnen Sie das <c>voodoo3</c> Flag aktivieren. 
Bei einer Matrox Karte schalten Sie einfach das <c>matrox</c> Flag ein.</p>

<p>Laptopnutzer werden wohl die <c>apm</c> und <c>pcmcia</c> Flags aktivieren. Wenn 
Sie <em>keine</em> Unterst&#252;tzung f&#252;r CardBus haben wollen, schalten sie <c>nocardbus</c> 
ein. die <c>pnp</c> Unterst&#252;tzung stellt PNP in pcmcia-cs zur Verf&#252;gung.</p>

<p>Sollte Sie einen Palm Pilot oder anderen PDA haben, den Sie mit Ihrere Gentoo 
Maschine verbinden m&#246;chten, sollten sie <c>pda</c> nutzen.</p>

<p>Wenn Sie vorhaben eine Digitalkamera zu nutzen, sollten Sie <c>gphoto2</c> aktivieren. 
Dies wird eine entsprechende Unterst&#252;tzung in die relevanten Anwendungen compilieren.</p>

<p>Wenn Sie einen Drucker nutzen m&#246;chten, k&#246;nnen Sie mit <c>cups</c> die CUPS Drucker 
Unterst&#252;tzung aktivieren. Mit <c>slp</c> schalten Sie "Service Locator Protocol" Unterst&#252;tzung 
f&#252;r CUPS ein.</p>

</body>
</section>

<section>
<title>BILDSCHIRM FLAGS</title>
<body>
<p>Wenn Sie das XFree86 System nutzen m&#246;chten, sollten Sie <c>X</c> aktivieren. Mit X 
k&#246;nnen Sie zus&#228;tzlich auch <c>dga</c> einschalten, um direkten Grafik Zugang (Direct 
Grpahic Acces - DGA) zu erhalten. Das <c>opengl</c> Flag aktiviert OpenGL Unterst&#252;tzung 
in vielen Anwendungen. Um die XVideo Erweiterung von XFree86 nutzen zu k&#246;nnen, m&#252;ssen 
Sie <c>xv</c> aktivieren. Nach einem Besucher im IRC Channel #gentoo bei openprojects.net 
(|Nagash|) "macht xv Mplayer gut"</p>

<p>Falls Sie auch Unterst&#252;tzung f&#252;r die Framebuffer Konsole (wie sie vom Kernel zur 
Verf&#252;gung gestellt wird - Der Pinguin beim Booten ist ein Beispiel) w&#252;nschen, schalten 
Sie das <c>fbcon</c> Flag ein.</p>

<p>Um bestimmte Anwendungen mit DirectFB zu nutzen, m&#252;ssen Sie <c>directfb</c> einschalten.</p>

</body>
</section>

<section>
<title>DESKTOP FLAGS</title>
<body>
<p>Sind Sie KDE Nutzer? Dann sind folgende Flags f&#252;r Sie:</p>
<p><c>kde</c> -- KDE Unterst&#252;tzung aktivieren</p>
<p><c>qt</c> -- Erlaubt das linken auf die Qt-Bibliotheken</p>
<p><c>qtmt</c> -- Erlaubt das linken auf die "multi-threaded" Qt-Bibliotheken</p>
<p><c>arts</c> -- Das KDE Sound System (artsd)</p>

<impo>Bitte beachten Sie, dass falls Sie keine KDE Unterst&#252;tzung w&#252;nschen mindestens 
<c>kde</c> und <c>arts</c> deaktiviert sind (-kde -arts).</impo>

<p>Sie bevorzugen GNOME? Dann benutzen Sie:</p>
<p><c>gnome</c> -- um Anwendungen mit GNOME Unterst&#252;tzung zu erstellen</p>
<p><c>gtk</c> -- um Anwendungen mit GTK+ Unterst&#252;tzung zu erstellen</p>
</body>
</section>


<section>
<title>GNOME FLAGS</title>
<body>
<p>Es gibt viel mehr Flags f&#252;r GNOME Nutzer.</p>
<p><c>bonobo</c> -- Unterst&#252;tzung f&#252;r GNOMEs CORBA durch Bonobo</p>
<p><c>evo</c> -- Unterst&#252;tzung f&#252;r Evolution (eine zu Outlook &#228;hnliche Anwendung)</p>
<p><c>gb</c> -- Unterst&#252;tzung f&#252;r Gnome Basic</p>
<p><c>gtkhtml</c> -- Unterst&#252;zung f&#252;r die GTK-HTML Bibliothek</p>

<warn>Um GNOME Unterst&#252;tzung zu deaktivieren, erg&#228;nzen Sie einfach <c>-gnome</c> zu Ihrer USE Zeile in <path>/etc/make.conf</path></warn>

</body>
</section>

<section>
<title>GRAFIK BIBLIOTHEKEN</title>
<body>
<p>Es gibt viele Bibliotheken, die Multimedia Unterst&#252;tzung liefern. Fangen wir also 
mit den Grafik Bibliotheken an. Im vorigen Abschnitt haben wir bereits die GTK und Qt 
Toolkit Bibliotheken gesehen. Andere m&#246;gliche Optionen sind:</p>

<p><c>motif</c> -- f&#252;r OpenMotif Unterst&#252;tzung</p>
<p><c>tcltk</c> -- f&#252;r Tcl und/oder Tk Unterst&#252;tzung</p>
<p><c>aalib</c> -- Unterst&#252;tzung f&#252;r ASCII Grafiken</p>
<p><c>imlib</c> -- Unterst&#252;tzung f&#252;r Imlib (image loading and rendering library)</p>
<p><c>ncurses</c> -- Unterst&#252;tzung f&#252;r Ncurses Konsolen Darstellung - dies bieten eine menge Anwendungen</p>
<p><c>readline</c> -- eine andere auf der Konsole basierende Bibliothek</p>
<p><c>sdl</c> -- SDL (Simple Direct Layer media library) wird von vielen Spielen gebraucht</p>
<p><c>svga</c> -- Einige Anwendungen bieten Unterst&#252;tzung von SVGAlib. NICHT f&#252;r PPC Benutzer!</p>
<p><c>lcms</c> -- Bietet Farbmanagement Unterst&#252;tzung f&#252;r die Imagemagick Bibliothek</p>

<p>Mit den folgenden Flags k&#246;nnen Sie Unterst&#252;tzung f&#252;r folgende Gragikformate aktivieren:</p>

<p><c>gif</c> -- Unterst&#252;tzung f&#252;r GIF Grafiken (libungif oder giflib)</p>
<p><c>jpeg</c> -- Unterst&#252;tzung f&#252;r JPEG Grafiken (libjpeg)</p>
<p><c>png</c> -- Unterst&#252;tzung f&#252;r PNG Grafiken</p>
<p><c>tiff</c> -- Unterst&#252;tzung f&#252;r TIFF Grafiken</p>

</body>
</section>

<section>
<title>VIDEO BIBLIOTHEKEN</title>
<body>
<p>Sie schauen gerne Videos? Dann m&#246;chten Sie vielleicht einige der folgenden Flags 
aktivieren:</p>

<p><c>avi</c> -- Unterst&#252;tzung f&#252;r die avifile Bibliothek und optional der Win32 Codec Bibliothek</p>
<p><c>mpeg</c> -- Unterst&#252;tzung f&#252;r die libmpeg3 Bibliothek</p>
<p><c>quicktime</c> -- Unterst&#252;tzung f&#252;r Quicktime mittels OpenQuickTime und Quicktime4Linux</p>

</body>
</section>

<section>
<title>SOUND BIBLIOTHEKEN</title>
<body>
<p>Es gibt eine ganze menge Sound Bibliotheken. </p>
<p><c>alsa</c> -- ALSA Soundtreiber (Advanced Linux Sound Architecture)</p>
<p><c>esd</c> -- ESD Sounddaemon (Enlightened Sound Daemon)</p>
<p><c>mikmod</c> -- Eine Bibliothek f&#252;r MikMod Sound Module</p>
<p><c>oss</c> -- Das Open Sound System</p>
<p><c>nas</c> -- Network Audio Sound</p>

</body>
</section>

<section>
<title>ANDERE MULTIMEDIA FLAGS</title>
<body>
<p><c>ggi</c> -- Unterst&#252;tzung f&#252;r Nicht-X Video Treiber</p>
<p><c>dvd</c> -- Unterst&#252;tzung f&#252;r das Abspielen und Entschl&#252;sseln von DVD via libcss Bibliothek</p>
<p><c>xmms</c> - Das X MultiMedia System</p>
<p><c>oggvorbis</c> -- Unterst&#252;tzung f&#252;r das Ogg Vorbis Format</p>
<p><c>flash</c> -- Unterst&#252;tzung f&#252;r das Erstellen von Flash Dateien mittels Ming</p>
<p><c>encode</c> -- Zum encoden verschiedener Multimedia Formate</p>

</body>
</section>

<section>
<title>NETZWERK FLAGS</title>
<body>
<p>Nat&#252;rlich m&#246;chten Sie Ihre Gentoo Box an ein Netzwerk anschliessen ;)</p>
<p><c>ipv6</c> -- Unterst&#252;tzung f&#252;r IPv6</p>
<p><c>snmp</c> -- Unterst&#252;tzung f&#252;r das Simple Network Management Protocol zum Betreuen von entfernten 
Maschinen</p>

</body>
</section>

<section>
<title>SICHERHEITS FLAGS</title>
<body>
<p>Wenn Sicherheit f&#252;r Sie ein Thema ist (was es sein sollte!), empfehlen wir das aktivieren 
von PAM:</p>
<p><c>pam</c> -- Pluggable Authentication Modules</p>
<p><c>ssl</c> -- Secure Socket Layer -- wird von SSH ben&#246;tigt. Apache und verschiedene Mailclients 
unterst&#252;tzen dies ebenfalls um sichere Verbindungen zu etablieren.</p>
<p><c>crypt</c> -- Unterst&#252;tzung von mcrypt, mhash und GPG Verschl&#252;sselung</p>
<p><c>socks5</c> -- Unterst&#252;tzung f&#252;r Socks5</p>

</body>
</section>

<section>
<title>MAIL FLAGS</title>
<body>
<p><c>imap</c> -- Unterst&#252;tzung f&#252;r IMAP</p>
<p><c>ldap</c> -- LDAP-Unterst&#252;tzung (Lightweight Directory Accesss Protocol)</p>
<p><c>tcpd</c> -- Unterst&#252;tzung f&#252;r TCP Wrapper</p>
<p><c>xface</c> -- Unterst&#252;tzung f&#252;r Xface, Sylpheed und Sylpheed-Claws</p>
</body>
</section>


<section>
<title>MOZILLA FLAGS</title>
<body>
<p><c>mozilla</c> -- Unterst&#252;tzung f&#252;r Mozilla einer Anwendungen</p>
<p>Beim Einspielen von Mozilla via emerge sollten Sie sich auch folgendes anschauen:</p>
<p><c>mozaccess-builtin</c> -- Erg&#228;nzt Zusatzpakete wie Text-zu-Sprache oder Braille Unterst&#252;tzung</p>
<p><c>mozctl</c> -- Erg&#228;nzt Pango &#228;hnliche Module</p>
<p><c>mozirc</c> -- Erg&#228;nzt einen IRC (Internet Relay Chat) Client zu Mozilla</p>
<p><c>mozxmlterm</c> -- Erg&#228;nzt ein xterm-&#228;hnliches Terminal mit XML Unterst&#252;tzung zu Mozilla</p>

</body>
</section>

<section>
<title>B&#220;RO-SPEZIFISCHE FLAGS</title>
<body>
<p><c>spell</c> -- Unterst&#252;tzung f&#252;r Rechtschreibpr&#252;fung via ispell/aspell/pspell</p>
<p><c>truetype</c> -- Unterst&#252;tzung f&#252;r FreeType und FreeType2 Schriftarten</p>
<p><c>xml</c> -- Unterst&#252;tzung f&#252;r die XML Bibliothek (Version 1)</p>
<p><c>xml2</c> -- Unterst&#252;tzung f&#252;r Gnomes XML Bibliothek (Version 2)</p>
<p><c>pdflib</c> -- PDF (Adobes Portable Document Format) Unterst&#252;tzung</p>
<p><c>plotutils</c> -- Unterst&#252;tzung f&#252;rs Plotten in gnuplot</p>
<p><c>tetex</c> -- Unterst&#252;tzung f&#252;r TeTeX eines der besten Publishingtools</p>

</body>
</section>

<section>
<title>SPRACHEN</title>
<body>
<p><c>guile</c> -- Guile ist ein Interpreter f&#252;r Scheme</p>
<p><c>java</c></p>
<p><c>perl</c></p>
<p><c>python</c></p>
<p><c>ruby</c></p>
<p><c>slang</c> -- S-Lang ist eine leistungsstarke Sprache</p>
<p><c>libwww</c> -- </p>
<p><c>libg++</c> -- Erg&#228;nzt C++ Module</p>
<p><c>atlas</c> --</p>
<p><c>pic</c>--</p>
</body></section>




<section>
<title>DATENBANK FLAGS</title>
<body>
<p>Sie haben einige Datenbanktypen zur Auswahl f&#252;r die Unterst&#252;tzung m&#246;glich ist:</p>
<p><c>berkdb</c> -- BerkleyDB f&#252;r MySQL</p>
<p><c>mysql</c> -- MySQL</p>
<p><c>postgres</c> -- PostgreSQL</p>
<p><c>odbc</c> -- Unterst&#252;tzung f&#252;r UnixODBC (Open Database Connectivity)</p>
<p><c>innodb</c> -- Unterst&#252;tzung f&#252;r MySQL transaction</p>
<p><c>gd</c> -- GNU database Bibliotheken</p>
<p><c>gdbm</c> -- dito</p>

</body>
</section>

<section>
<title>FILESYSTEM FLAGS</title>
<body>
<p><c>acl</c> -- Unterst&#252;tzung f&#252;r die XFS Utilities von SGI</p>
<p><c>afs</c> -- OpenAFS</p>
<p><c>samba</c> -- Unterst&#252;tzung f&#252;r SAMBA</p>

</body>
</section>

<section>
<title>WEITERE N&#220;TZLICHE FLAGS</title>
<body>
<p><c>nls</c> -- Unterst&#252;tzung f&#252;r NLS (Native Language Support), verwendet die gettext Bibliotheken, 
wenn Sie nur eine Sprache verwenden ist dies nicht n&#246;tig</p>
<p><c>doc</c> -- Hierdurch wird weitere Dokumentation erstellt</p>
<p><c>gpm</c> -- Erg&#228;nzt Mausunterst&#252;tzung f&#252;r die Konsole</p>

</body>
</section>

<section>
<title>FLAGS, WELCHE <b>NICHT</b> BER&#220;HRT WERDEN D&#220;RFEN!</title>
<body>
<p>
Diese Flags d&#252;rfen <b>nicht</b> ber&#252;hrt werden! Sie werden hier nur genannt um diese Dokumentation 
zu vervollst&#228;ndigen. Diese Flags werden automatisch mit Ihrem Profil gesetzt. Solange Sie nicht 
<b>genau</b> wissen was Sie tun, aktivieren oder deaktivieren Sie diese Flags nicht in Ihrer 
Konfiguration.
</p>

<p><c>x86</c> -- Identifiziert Ihren Rechner als x86 kompatibel.</p>
<p><c>ppc</c> -- Identifiziert Ihren Rechner als PowerPC.</p>
<p><c>sparc</c> -- Identifiziert Ihren Rechner als Sparc.</p>
<p><c>sparc64</c> -- Identifiziert Ihren Rechner als 64-bit Sparc.</p>
</body>
</section>

</chapter>
</guide>
